-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kevincao/Desktop/ECON80/ECON80-Paper/master_log.log
  log type:  text
 opened on:  29 Nov 2024, 19:48:19

. 
. // Clean and link the raw CPS datasets
. do "./Data/CPS Clean/construct_01.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg01.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 02 03 04 {
  2.         
.         append using "../CPS Raw/morg`year'"
  3.         
. }
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label docc80l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label P37L already defined)
(label ind02l already defined)
(label P36L already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label msafips already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(variable earnwke was int, now double to accommodate using data's values)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label msafips already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label msafips already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)

. 
. 
. gen occ = .
(1,284,545 missing values generated)

. gen ind = .
(1,284,545 missing values generated)

. 
. replace ind = 1 if (year >= 2000 & year <= 2019) & ind02 <= 290
(18,847 real changes made)

. replace ind = 2 if (year >= 2000 & year <= 2019) & ind02 >= 370 & ind02 <= 490
(4,496 real changes made)

. replace ind = 3 if (year >= 2000 & year <= 2019) & ind02 == 770
(66,112 real changes made)

. replace ind = 4 if (year >= 2000 & year <= 2019) & ind02 >= 1070 & ind02 <= 3990
(105,657 real changes made)

. replace ind = 5 if (year >= 2000 & year <= 2019) & ind02 >= 4070 & ind02 <= 4590
(26,400 real changes made)

. replace ind = 6 if (year >= 2000 & year <= 2019) & ind02 >= 4690 & ind02 <= 5790
(95,539 real changes made)

. replace ind = 7 if (year >= 2000 & year <= 2019) & ind02 >= 6070 & ind02 <= 6390
(36,423 real changes made)

. replace ind = 8 if (year >= 2000 & year <= 2019) & ind02 >= 570 & ind02 <= 690
(7,826 real changes made)

. replace ind = 9 if (year >= 2000 & year <= 2019) & ind02 >= 6470 & ind02 <= 6780
(22,807 real changes made)

. replace ind = 10 if (year >= 2000 & year <= 2019) & ind02 >= 6870 & ind02 <= 6990
(42,507 real changes made)

. replace ind = 11 if (year >= 2000 & year <= 2019) & ind02 >= 7070 & ind02 <= 7190
(17,583 real changes made)

. replace ind = 12 if (year >= 2000 & year <= 2019) & ind02 >= 7270 & ind02 <= 7490
(51,615 real changes made)

. replace ind = 13 if (year >= 2000 & year <= 2019) & ind02 == 7570
(256 real changes made)

. replace ind = 14 if (year >= 2000 & year <= 2019) & ind02 >= 7580 & ind02 <= 7790
(36,651 real changes made)

. replace ind = 15 if (year >= 2000 & year <= 2019) & ind02 >= 7860 & ind02 <= 7890
(77,880 real changes made)

. replace ind = 16 if (year >= 2000 & year <= 2019) & ind02 >= 7970 & ind02 <= 8470
(103,561 real changes made)

. replace ind = 17 if (year >= 2000 & year <= 2019) & ind02 >= 8560 & ind02 <= 8590
(18,950 real changes made)

. replace ind = 18 if (year >= 2000 & year <= 2019) & ind02 >= 8660 & ind02 <= 8690 
(62,173 real changes made)

. replace ind = 19 if (year >= 2000 & year <= 2019) & ind02 >= 8770 & ind02 <= 9290
(43,207 real changes made)

. replace ind = 20 if (year >= 2000 & year <= 2019) & ind02 >= 9370 & ind02 <= 9590
(41,039 real changes made)

. replace ind = 21 if (year >= 2000 & year <= 2019) & ind02 >= 9670 & ind02 <= 9870
(0 real changes made)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(0 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(0 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(0 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(0 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(0 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(0 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(0 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(0 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(0 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(0 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(0 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(937 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(0 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(0 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(0 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(0 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(75 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(0 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(1,000 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(0 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(0 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(0 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(0 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(3,138 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(2,484 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(0 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(0 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(0 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(0 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(8,417 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(0 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(0 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(0 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(0 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(2,487 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(0 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(0 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(0 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(0 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(0 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(0 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(0 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(0 real changes made)

. 
. replace occ = 1 if (year >= 2000 & year <= 2010) & occ00 <= 430
(92,805 real changes made)

. replace occ = 2 if (year >= 2000 & year <= 2010) & occ00 >= 500 & occ00 <= 950
(33,563 real changes made)

. replace occ = 3 if (year >= 2000 & year <= 2010) & occ00 >= 1000 & occ00 <= 1240
(18,535 real changes made)

. replace occ = 4 if (year >= 2000 & year <= 2010) & occ00 >= 1300 & occ00 <= 1560
(15,150 real changes made)

. replace occ = 5 if (year >= 2000 & year <= 2010) & occ00 >= 1600 & occ00 <= 1960
(7,295 real changes made)

. replace occ = 6 if (year >= 2000 & year <= 2010) & occ00 >= 2000 & occ00 <= 2060
(13,568 real changes made)

. replace occ = 7 if (year >= 2000 & year <= 2010) & occ00 >= 2100 & occ00 <= 2150
(9,427 real changes made)

. replace occ = 8 if (year >= 2000 & year <= 2010) & occ00 >= 2200 & occ00 <= 2550
(50,432 real changes made)

. replace occ = 9 if (year >= 2000 & year <= 2010) & occ00 >= 2600 & occ00 <= 2960
(17,301 real changes made)

. replace occ = 10 if (year >= 2000 & year <= 2010) & occ00 >= 3000 & occ00 <= 3540
(33,538 real changes made)

. replace occ = 11 if (year >= 2000 & year <= 2010) & occ00 >= 3600 & occ00 <= 3650
(18,101 real changes made)

. replace occ = 12 if (year >= 2000 & year <= 2010) & occ00 >= 3700 & occ00 <= 3950
(16,913 real changes made)

. replace occ = 13 if (year >= 2000 & year <= 2010) & occ00 >= 4000 & occ00 <= 4160
(49,018 real changes made)

. replace occ = 14 if (year >= 2000 & year <= 2010) & occ00 >= 4200 & occ00 <= 4250
(34,164 real changes made)

. replace occ = 15 if (year >= 2000 & year <= 2010) & occ00 >= 4300 & occ00 <= 4650
(28,566 real changes made)

. replace occ = 16 if (year >= 2000 & year <= 2010) & occ00 >= 4700 & occ00 <= 4960
(102,413 real changes made)

. replace occ = 17 if (year >= 2000 & year <= 2010) & occ00 >= 5000 & occ00 <= 5930
(128,227 real changes made)

. replace occ = 18 if (year >= 2000 & year <= 2010) & occ00 >= 6000 & occ00 <= 6130
(8,043 real changes made)

. replace occ = 19 if (year >= 2000 & year <= 2010) & occ00 >= 6200 & occ00 <= 6940
(53,236 real changes made)

. replace occ = 20 if (year >= 2000 & year <= 2010) & occ00 >= 7000 & occ00 <= 7620
(30,472 real changes made)

. replace occ = 21 if (year >= 2000 & year <= 2010) & occ00 >= 7700 & occ00 <= 8960
(63,148 real changes made)

. replace occ = 22 if (year >= 2000 & year <= 2010) & occ00 >= 9000 & occ00 <= 9420
(31,708 real changes made)

. replace occ = 23 if (year >= 2000 & year <= 2010) & occ00 >= 9500 & occ00 <= 9750
(22,952 real changes made)

. replace occ = 24 if (year >= 2000 & year <= 2010) & occ00 >= 9800
(395,218 real changes made)

. 
. keep if hhnum == 1
(63,812 observations deleted)

. egen nobs = count(hhid), by(hhid hrhhid2 lineno hrsample hurespli ind occ) 

. keep if nobs == 2
(971,799 observations deleted)

. // drop nobs
. 
. // drop hrhhid2 out of this just because they only start appearing in '04 and '04 doesn't get matched here
. // we need a way to match '04 to '05
. egen id = group(hhid lineno hrsample hurespli)

. 
. sort id minsamp

. 
. gen is_mis4 = (minsamp == 4)

. gen is_mis8 = (minsamp == 8)

. 
. bysort id: egen mis4 = total(is_mis4)

. bysort id: egen mis8 = total(is_mis8)

. 
. keep if (mis4 == 1 & mis8 == 1)
(52 observations deleted)

. 
. tsset id year

Panel variable: id (weakly balanced)
 Time variable: year, 2001 to 2004
         Delta: 1 unit

. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(48,461 observations deleted)

. keep if I25b == 0
(7,755 observations deleted)

. 
. drop if earnhre == 9999
(5 observations deleted)

. drop if missing(earnhre)
(136,840 observations deleted)

.         
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(12,523 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(43,298 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(21,649 missing values generated)

. drop if missing(lag_earnhre)
(21,649 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(4,537 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str6

. replace id = id + "_X"
variable id was str6 now str8
(17,112 real changes made)

. 
. save "cleaned_data_01to04.dta", replace
file cleaned_data_01to04.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_04.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. *************************** Compile the data **********************************
. 
. 
. use "../CPS Raw/morg04.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 {
  2.         
.         append using "../CPS Raw/morg`year'.dta" 
  3.         
. }
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label cbsafips already defined)
(label smsa04 already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label vet already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label age already defined)
(label cbsafips already defined)
(label smsa04 already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ2011l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(variable dind02 was byte, now int to accommodate using data's values)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ182l already defined)
(label occ18l already defined)
(label ind17l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label ethnic8 already defined)
(label race26 already defined)
(label cbsafipsl already defined)
(label dwrsnl already defined)
(label chldpresl already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ182l already defined)
(label occ18l already defined)
(label ind17l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label ethnic8 already defined)
(label race26 already defined)
(label cbsafipsl already defined)
(label dwrsnl already defined)
(label chldpresl already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ182l already defined)
(label occ18l already defined)
(label ind17l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label ethnic8 already defined)
(label race26 already defined)
(label cbsafipsl already defined)
(label dwrsnl already defined)
(label chldpresl already defined)

. 
. // Need to first convert first or else we don't know who switched between certain years (since no more overlap)
. 
. /* New industry mapping
> 1 --> Agriculture/Forestry/Fishing/Hunting
> 2 --> Mining/Quarrying/OilExtraction
> 3 --> Construction
> 4 --> Manufacturing
> 5 --> Wholesale Trade
> 6 --> Retail Trade
> 7 --> Transportation and Warehousing
> 8 --> Utilities
> 9 --> Information/Communications
> 10 --> Finance/Insurance
> 11 --> Real Estate/Renting
> 12 --> Professional/Scientific/Technical Services
> 13 --> Management of Companies/Enterprises/Consulting
> 14 --> Administrative/Support/Waste Management Services
> 15 --> Education
> 16 --> Healthcare/Social Assistance
> 17 --> Arts/Entertainment/Recreation
> 18 --> Accomodation/Food Services
> 19 --> Other Services (e.g. car maintenance, beauty salons, religion, funeral homes)
> 20 --> Public Administration
> 21 --> Military
> */
. 
. cap drop ind

. gen ind = .
(6,077,861 missing values generated)

. 
. replace ind = 1 if (year >= 2020) & ind17 <= 290
(12,596 real changes made)

. replace ind = 2 if (year >= 2020) & ind17 >= 370 & ind17 <= 490
(3,889 real changes made)

. replace ind = 3 if (year >= 2020) & ind17 == 770
(46,966 real changes made)

. replace ind = 4 if (year >= 2020) & ind17 >= 1070 & ind17 <= 3990
(60,407 real changes made)

. replace ind = 5 if (year >= 2020) & ind17 >= 4070 & ind17 <= 4590
(13,374 real changes made)

. replace ind = 6 if (year >= 2020) & ind17 >= 4670 & ind17 <= 5790
(68,346 real changes made)

. replace ind = 7 if (year >= 2020) & ind17 >= 6070 & ind17 <= 6390
(31,825 real changes made)

. replace ind = 8 if (year >= 2020) & ind17 >= 570 & ind17 <= 690
(5,939 real changes made)

. replace ind = 9 if (year >= 2020) & ind17 >= 6470 & ind17 <= 6780
(10,995 real changes made)

. replace ind = 10 if (year >= 2020) & ind17 >= 6870 & ind17 <= 6992
(29,535 real changes made)

. replace ind = 11 if (year >= 2020) & ind17 >= 7071 & ind17 <= 7190
(13,011 real changes made)

. replace ind = 12 if (year >= 2020) & ind17 >= 7270 & ind17 <= 7490
(51,661 real changes made)

. replace ind = 13 if (year >= 2020) & ind17 == 7570
(329 real changes made)

. replace ind = 14 if (year >= 2020) & ind17 >= 7580 & ind17 <= 7790
(26,648 real changes made)

. replace ind = 15 if (year >= 2020) & ind17 >= 7860 & ind17 <= 7890
(58,753 real changes made)

. replace ind = 16 if (year >= 2020) & ind17 >= 7970 & ind17 <= 8470
(88,515 real changes made)

. replace ind = 17 if (year >= 2020) & ind17 >= 8561 & ind17 <= 8590
(14,027 real changes made)

. replace ind = 18 if (year >= 2020) & ind17 >= 8660 & ind17 <= 8690
(43,201 real changes made)

. replace ind = 19 if (year >= 2020) & ind17 >= 8770 & ind17 <= 9290
(31,025 real changes made)

. replace ind = 20 if (year >= 2020) & ind17 >= 9370 & ind17 <= 9590
(34,041 real changes made)

. replace ind = 21 if (year >= 2020) & ind17 >= 9670 & ind17 <= 9870
(0 real changes made)

. 
.         
. replace ind = 1 if (year >= 2000 & year <= 2019) & ind02 <= 290
(67,042 real changes made)

. replace ind = 2 if (year >= 2000 & year <= 2019) & ind02 >= 370 & ind02 <= 490
(23,789 real changes made)

. replace ind = 3 if (year >= 2000 & year <= 2019) & ind02 == 770
(241,727 real changes made)

. replace ind = 4 if (year >= 2000 & year <= 2019) & ind02 >= 1070 & ind02 <= 3990
(338,707 real changes made)

. replace ind = 5 if (year >= 2000 & year <= 2019) & ind02 >= 4070 & ind02 <= 4590
(85,814 real changes made)

. replace ind = 6 if (year >= 2000 & year <= 2019) & ind02 >= 4690 & ind02 <= 5790
(347,565 real changes made)

. replace ind = 7 if (year >= 2000 & year <= 2019) & ind02 >= 6070 & ind02 <= 6390
(139,005 real changes made)

. replace ind = 8 if (year >= 2000 & year <= 2019) & ind02 >= 570 & ind02 <= 690
(28,213 real changes made)

. replace ind = 9 if (year >= 2000 & year <= 2019) & ind02 >= 6470 & ind02 <= 6780
(70,361 real changes made)

. replace ind = 10 if (year >= 2000 & year <= 2019) & ind02 >= 6870 & ind02 <= 6990
(155,344 real changes made)

. replace ind = 11 if (year >= 2000 & year <= 2019) & ind02 >= 7070 & ind02 <= 7190
(66,337 real changes made)

. replace ind = 12 if (year >= 2000 & year <= 2019) & ind02 >= 7270 & ind02 <= 7490
(218,409 real changes made)

. replace ind = 13 if (year >= 2000 & year <= 2019) & ind02 == 7570
(3,136 real changes made)

. replace ind = 14 if (year >= 2000 & year <= 2019) & ind02 >= 7580 & ind02 <= 7790
(143,310 real changes made)

. replace ind = 15 if (year >= 2000 & year <= 2019) & ind02 >= 7860 & ind02 <= 7890
(306,340 real changes made)

. replace ind = 16 if (year >= 2000 & year <= 2019) & ind02 >= 7970 & ind02 <= 8470
(432,914 real changes made)

. replace ind = 17 if (year >= 2000 & year <= 2019) & ind02 >= 8560 & ind02 <= 8590
(75,874 real changes made)

. replace ind = 18 if (year >= 2000 & year <= 2019) & ind02 >= 8660 & ind02 <= 8690 
(239,388 real changes made)

. replace ind = 19 if (year >= 2000 & year <= 2019) & ind02 >= 8770 & ind02 <= 9290
(163,077 real changes made)

. replace ind = 20 if (year >= 2000 & year <= 2019) & ind02 >= 9370 & ind02 <= 9590
(163,049 real changes made)

. replace ind = 21 if (year >= 2000 & year <= 2019) & ind02 >= 9670 & ind02 <= 9870
(0 real changes made)

.         
. 
. // replace ind = 21 if ...
. 
. // Reintroduce the labels for the new ind variable
. label define ind_labels 1 "Agriculture/Forestry/Fishing/Hunting" ///
>                        2 "Mining/Oil" ///
>                        3 "Construction" ///
>                        4 "Manufacturing" ///
>                        5 "Wholesale Trade" ///
>                        6 "Retail Trade" ///
>                        7 "Transportation/Warehousing" ///
>                        8 "Utilities" ///
>                        9 "Communications" ///
>                        10 "Finance/Insurance" ///
>                        11 "Real Estate" ///
>                        12 "Professional/Scientific/Technical Services" ///
>                        13 "Consulting" ///
>                        14 "Business Administrative/Support Services" ///
>                        15 "Education" ///
>                        16 "Healthcare/Social Assistance" ///
>                        17 "Arts/Entertainment/Recreation" ///
>                        18 "Accommodation/Food Services" ///
>                        19 "Other Services" ///
>                        20 "Public Administration" ///
>                        21 "Military"

. 
. label values ind ind_labels

. 
. drop if missing(ind)            // Drops 298 observations, all from older datasets
(2,123,377 observations deleted)

. 
. 
. 
. // Make a consistent new occupation variable
. 
. cap drop occ

. gen occ = .
(3,954,484 missing values generated)

. 
. replace occ = 1 if (year >= 2020) & occ18 <= 440 
(81,663 real changes made)

. replace occ = 2 if (year >= 2020) & occ18 >= 500 & occ18 <= 960
(35,911 real changes made)

. replace occ = 3 if (year >= 2020) & occ18 >= 1005 & occ18 <= 1240
(21,959 real changes made)

. replace occ = 4 if (year >= 2020) & occ18 >= 1305 & occ18 <= 1560
(13,216 real changes made)

. replace occ = 5 if (year >= 2020) & occ18 >= 1600 & occ18 <= 1980
(7,431 real changes made)

. replace occ = 6 if (year >= 2020) & occ18 >= 2001 & occ18 <= 2060
(11,736 real changes made)

. replace occ = 7 if (year >= 2020) & occ18 >= 2100 & occ18 <= 2180
(7,921 real changes made)

. replace occ = 8 if (year >= 2020) & occ18 >= 2205 & occ18 <= 2255
(4,865 real changes made)

. replace occ = 9 if (year >= 2020) & occ18 >= 2600 & occ18 <= 2970
(13,582 real changes made)

. replace occ = 10 if (year >= 2020) & occ18 >= 3000 & occ18 <= 3550
(39,660 real changes made)

. replace occ = 11 if (year >= 2020) & occ18 >= 3601 & occ18 <= 4655
(105,260 real changes made)

. replace occ = 12 if (year >= 2020) & occ18 >= 3700 & occ18 <= 3960
(12,192 real changes made)

. replace occ = 13 if (year >= 2020) & occ18 >= 4000 & occ18 <= 4160
(32,840 real changes made)

. replace occ = 14 if (year >= 2020) & occ18 >= 4200 & occ18 <= 4255
(23,524 real changes made)

. replace occ = 15 if (year >= 2020) & occ18 >= 4300 & occ18 <= 4655
(16,461 real changes made)

. replace occ = 16 if (year >= 2020) & occ18 >= 4700 & occ18 <= 4965
(59,977 real changes made)

. replace occ = 17 if (year >= 2020) & occ18 >= 5000 & occ18 <= 5940
(67,486 real changes made)

. replace occ = 18 if (year >= 2020) & occ18 >= 6005 & occ18 <= 6130
(5,282 real changes made)

. replace occ = 19 if (year >= 2020) & occ18 >= 6200 & occ18 <= 6950
(33,966 real changes made)

. replace occ = 20 if (year >= 2020) & occ18 >= 7000 & occ18 <= 7640
(19,944 real changes made)

. replace occ = 21 if (year >= 2020) & occ18 >= 7700 & occ18 <= 8990
(33,488 real changes made)

. replace occ = 22 if (year >= 2020) & occ18 >= 9005 & occ18 <= 9430
(23,839 real changes made)

. replace occ = 23 if (year >= 2020) & occ18 >= 9510 & occ18 <= 9760
(23,536 real changes made)

. replace occ = 24 if (year >= 2020) & occ18 >= 9800
(0 real changes made)

. 
. // For some reason occ2012 and occ2011 are split; they are the same
. replace occ = 1 if (year >= 2012 & year <= 2019) & occ2012 <= 430
(174,132 real changes made)

. replace occ = 2 if (year >= 2012 & year <= 2019) & occ2012 >= 500 & occ2012 <= 950
(72,060 real changes made)

. replace occ = 3 if (year >= 2012 & year <= 2019) & occ2012 >= 1000 & occ2012 <= 1240
(42,178 real changes made)

. replace occ = 4 if (year >= 2012 & year <= 2019) & occ2012 >= 1300 & occ2012 <= 1560
(29,423 real changes made)

. replace occ = 5 if (year >= 2012 & year <= 2019) & occ2012 >= 1600 & occ2012 <= 1965
(15,285 real changes made)

. replace occ = 6 if (year >= 2012 & year <= 2019) & occ2012 >= 2000 & occ2012 <= 2060
(26,650 real changes made)

. replace occ = 7 if (year >= 2012 & year <= 2019) & occ2012 >= 2100 & occ2012 <= 2160
(19,023 real changes made)

. replace occ = 8 if (year >= 2012 & year <= 2019) & occ2012 >= 2200 & occ2012 <= 2550
(94,452 real changes made)

. replace occ = 9 if (year >= 2012 & year <= 2019) & occ2012 >= 2600 & occ2012 <= 2960
(31,698 real changes made)

. replace occ = 10 if (year >= 2012 & year <= 2019) & occ2012 >= 3000 & occ2012 <= 3540
(87,679 real changes made)

. replace occ = 11 if (year >= 2012 & year <= 2019) & occ2012 >= 3600 & occ2012 <= 3655
(35,263 real changes made)

. replace occ = 12 if (year >= 2012 & year <= 2019) & occ2012 >= 3700 & occ2012 <= 3955
(30,900 real changes made)

. replace occ = 13 if (year >= 2012 & year <= 2019) & occ2012 >= 4000 & occ2012 <= 4160
(86,061 real changes made)

. replace occ = 14 if (year >= 2012 & year <= 2019) & occ2012 >= 4200 & occ2012 <= 4250
(60,678 real changes made)

. replace occ = 15 if (year >= 2012 & year <= 2019) & occ2012 >= 4300 & occ2012 <= 4650
(58,826 real changes made)

. replace occ = 16 if (year >= 2012 & year <= 2019) & occ2012 >= 4700 & occ2012 <= 4965
(152,004 real changes made)

. replace occ = 17 if (year >= 2012 & year <= 2019) & occ2012 >= 5000 & occ2012 <= 5940
(181,928 real changes made)

. replace occ = 18 if (year >= 2012 & year <= 2019) & occ2012 >= 6005 & occ2012 <= 6130
(13,416 real changes made)

. replace occ = 19 if (year >= 2012 & year <= 2019) & occ2012 >= 6200 & occ2012 <= 6940
(81,840 real changes made)

. replace occ = 20 if (year >= 2012 & year <= 2019) & occ2012 >= 7000 & occ2012 <= 7630
(46,409 real changes made)

. replace occ = 21 if (year >= 2012 & year <= 2019) & occ2012 >= 7700 & occ2012 <= 8965
(85,262 real changes made)

. replace occ = 22 if (year >= 2012 & year <= 2019) & occ2012 >= 9000 & occ2012 <= 9420
(55,291 real changes made)

. replace occ = 23 if (year >= 2012 & year <= 2019) & occ2012 >= 9500 & occ2012 <= 9750
(36,887 real changes made)

. replace occ = 24 if (year >= 2012 & year <= 2019) & occ2012 >= 9800 & occ2012 <= 9830
(0 real changes made)

. 
. replace occ = 1 if (year >= 2011 & year <= 2012) & occ2011 <= 430
(29,801 real changes made)

. replace occ = 2 if (year >= 2011 & year <= 2012) & occ2011 >= 500 & occ2011 <= 950
(12,305 real changes made)

. replace occ = 3 if (year >= 2011 & year <= 2012) & occ2011 >= 1000 & occ2011 <= 1240
(6,672 real changes made)

. replace occ = 4 if (year >= 2011 & year <= 2012) & occ2011 >= 1300 & occ2011 <= 1560
(5,207 real changes made)

. replace occ = 5 if (year >= 2011 & year <= 2012) & occ2011 >= 1600 & occ2011 <= 1965
(2,697 real changes made)

. replace occ = 6 if (year >= 2011 & year <= 2012) & occ2011 >= 2000 & occ2011 <= 2060
(4,680 real changes made)

. replace occ = 7 if (year >= 2011 & year <= 2012) & occ2011 >= 2100 & occ2011 <= 2160
(3,395 real changes made)

. replace occ = 8 if (year >= 2011 & year <= 2012) & occ2011 >= 2200 & occ2011 <= 2550
(17,229 real changes made)

. replace occ = 9 if (year >= 2011 & year <= 2012) & occ2011 >= 2600 & occ2011 <= 2960
(5,590 real changes made)

. replace occ = 10 if (year >= 2011 & year <= 2012) & occ2011 >= 3000 & occ2011 <= 3540
(14,638 real changes made)

. replace occ = 11 if (year >= 2011 & year <= 2012) & occ2011 >= 3600 & occ2011 <= 3655
(6,654 real changes made)

. replace occ = 12 if (year >= 2011 & year <= 2012) & occ2011 >= 3700 & occ2011 <= 3955
(5,976 real changes made)

. replace occ = 13 if (year >= 2011 & year <= 2012) & occ2011 >= 4000 & occ2011 <= 4160
(16,035 real changes made)

. replace occ = 14 if (year >= 2011 & year <= 2012) & occ2011 >= 4200 & occ2011 <= 4250
(11,325 real changes made)

. replace occ = 15 if (year >= 2011 & year <= 2012) & occ2011 >= 4300 & occ2011 <= 4650
(10,574 real changes made)

. replace occ = 16 if (year >= 2011 & year <= 2012) & occ2011 >= 4700 & occ2011 <= 4965
(28,962 real changes made)

. replace occ = 17 if (year >= 2011 & year <= 2012) & occ2011 >= 5000 & occ2011 <= 5940
(35,852 real changes made)

. replace occ = 18 if (year >= 2011 & year <= 2012) & occ2011 >= 6005 & occ2011 <= 6130
(2,500 real changes made)

. replace occ = 19 if (year >= 2011 & year <= 2012) & occ2011 >= 6200 & occ2011 <= 6940
(15,274 real changes made)

. replace occ = 20 if (year >= 2011 & year <= 2012) & occ2011 >= 7000 & occ2011 <= 7630
(8,789 real changes made)

. replace occ = 21 if (year >= 2011 & year <= 2012) & occ2011 >= 7700 & occ2011 <= 8965
(16,232 real changes made)

. replace occ = 22 if (year >= 2011 & year <= 2012) & occ2011 >= 9000 & occ2011 <= 9420
(9,632 real changes made)

. replace occ = 23 if (year >= 2011 & year <= 2012) & occ2011 >= 9500 & occ2011 <= 9750
(6,712 real changes made)

. replace occ = 24 if (year >= 2011 & year <= 2012) & occ2011 >= 9800 & occ2011 <= 9830
(0 real changes made)

. 
. replace occ = 1 if (year >= 2000 & year <= 2010) & occ00 <= 430
(160,445 real changes made)

. replace occ = 2 if (year >= 2000 & year <= 2010) & occ00 >= 500 & occ00 <= 950
(61,384 real changes made)

. replace occ = 3 if (year >= 2000 & year <= 2010) & occ00 >= 1000 & occ00 <= 1240
(33,391 real changes made)

. replace occ = 4 if (year >= 2000 & year <= 2010) & occ00 >= 1300 & occ00 <= 1560
(28,298 real changes made)

. replace occ = 5 if (year >= 2000 & year <= 2010) & occ00 >= 1600 & occ00 <= 1960
(15,408 real changes made)

. replace occ = 6 if (year >= 2000 & year <= 2010) & occ00 >= 2000 & occ00 <= 2060
(24,230 real changes made)

. replace occ = 7 if (year >= 2000 & year <= 2010) & occ00 >= 2100 & occ00 <= 2150
(17,541 real changes made)

. replace occ = 8 if (year >= 2000 & year <= 2010) & occ00 >= 2200 & occ00 <= 2550
(90,420 real changes made)

. replace occ = 9 if (year >= 2000 & year <= 2010) & occ00 >= 2600 & occ00 <= 2960
(29,962 real changes made)

. replace occ = 10 if (year >= 2000 & year <= 2010) & occ00 >= 3000 & occ00 <= 3540
(73,941 real changes made)

. replace occ = 11 if (year >= 2000 & year <= 2010) & occ00 >= 3600 & occ00 <= 3650
(34,001 real changes made)

. replace occ = 12 if (year >= 2000 & year <= 2010) & occ00 >= 3700 & occ00 <= 3950
(30,656 real changes made)

. replace occ = 13 if (year >= 2000 & year <= 2010) & occ00 >= 4000 & occ00 <= 4160
(86,550 real changes made)

. replace occ = 14 if (year >= 2000 & year <= 2010) & occ00 >= 4200 & occ00 <= 4250
(59,874 real changes made)

. replace occ = 15 if (year >= 2000 & year <= 2010) & occ00 >= 4300 & occ00 <= 4650
(53,921 real changes made)

. replace occ = 16 if (year >= 2000 & year <= 2010) & occ00 >= 4700 & occ00 <= 4960
(166,355 real changes made)

. replace occ = 17 if (year >= 2000 & year <= 2010) & occ00 >= 5000 & occ00 <= 5930
(205,495 real changes made)

. replace occ = 18 if (year >= 2000 & year <= 2010) & occ00 >= 6000 & occ00 <= 6130
(12,829 real changes made)

. replace occ = 19 if (year >= 2000 & year <= 2010) & occ00 >= 6200 & occ00 <= 6940
(95,382 real changes made)

. replace occ = 20 if (year >= 2000 & year <= 2010) & occ00 >= 7000 & occ00 <= 7620
(50,097 real changes made)

. replace occ = 21 if (year >= 2000 & year <= 2010) & occ00 >= 7700 & occ00 <= 8960
(94,872 real changes made)

. replace occ = 22 if (year >= 2000 & year <= 2010) & occ00 >= 9000 & occ00 <= 9420
(53,114 real changes made)

. replace occ = 23 if (year >= 2000 & year <= 2010) & occ00 >= 9500 & occ00 <= 9750
(37,159 real changes made)

. replace occ = 24 if (year >= 2000 & year <= 2010) & occ00 >= 9800
(0 real changes made)

. 
. drop if missing(occ)    
(34,361 observations deleted)

. 
. // Find number of observations for each household 
. keep if hhnum == 1
(211,012 observations deleted)

. egen nobs = count(hhid), by(hhid hrhhid2 lineno ind occ)

. 
. // Drop if there aren't 2 different observations (might need to investigate if certain types of households dropped out so n
> o bias from attrition) *just use nobs == 1 for this*
. keep if nobs == 2
(2,277,491 observations deleted)

. drop nobs

. 
. 
. // Create a unique identifier
. egen id = group(hhid hrhhid2 lineno)
(6 missing values generated)

. 
. sort id minsamp

. 
. gen is_mis4 = (minsamp == 4)

. gen is_mis8 = (minsamp == 8)

. 
. bysort id: egen mis4 = total(is_mis4)

. bysort id: egen mis8 = total(is_mis8)

. 
. keep if (mis4 == 1 & mis8 == 1)
(6 observations deleted)

. 
. tsset id year

Panel variable: id (weakly balanced)
 Time variable: year, 2004 to 2023
         Delta: 1 unit

. 
. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(528,652 observations deleted)

. 
. // Drop anyone whose paid by hour status is questionable or may have changed
. keep if I25b == 0
(101,329 observations deleted)

. 
. // Remove anyone who is reported to have made $9999 per hour or missing (also people making like nothing?)
. drop if earnhre == 9999
(158 observations deleted)

. drop if missing(earnhre)
(236,732 observations deleted)

. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(144,999 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(419,744 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(209,872 missing values generated)

. drop if missing(lag_earnhre)
(209,872 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(50,946 observations deleted)

. 
. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str6

. replace id = id + "_A"
variable id was str6 now str8
(158,926 real changes made)

. 
. // Save and export
. save "cleaned_data_04to23.dta", replace
file cleaned_data_04to23.dta saved

. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_79.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg79.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 80 81 82 83 84 {
  2.         
.         append using "../CPS Raw/morg`year'.dta"
  3.         
. }
(label prunecat already defined)
(label ptstat already defined)
(label ftpt79 already defined)
(label why35lw already defined)
(label absentlw already defined)
(label reasonlw already defined)
(label uhours35 already defined)
(label doinglw already defined)
(label activlwr already defined)
(label eligible already defined)
(label docc70 already defined)
(label dind already defined)
(label ind70 already defined)
(label esr already defined)
(label classer already defined)
(label class already defined)
(label I25d already defined)
(label I25c already defined)
(label I25b already defined)
(label I25a already defined)
(label paidhre already defined)
(label paidhr already defined)
(label relahh already defined)
(label gradecp already defined)
(label veteran already defined)
(label marital already defined)
(label ethnic already defined)
(label race already defined)
(label sex already defined)
(label smsarank already defined)
(label smsa70 already defined)
(label centcity already defined)
(label smsastat already defined)
(label state already defined)
(label intmonth already defined)
(label minsamp already defined)
(label prunecat already defined)
(label ptstat already defined)
(label ftpt79 already defined)
(label why35lw already defined)
(label absentlw already defined)
(label reasonlw already defined)
(label uhours35 already defined)
(label doinglw already defined)
(label activlwr already defined)
(label eligible already defined)
(label docc70 already defined)
(label dind already defined)
(label ind70 already defined)
(label esr already defined)
(label classer already defined)
(label class already defined)
(label I25d already defined)
(label I25c already defined)
(label I25b already defined)
(label I25a already defined)
(label paidhre already defined)
(label paidhr already defined)
(label relahh already defined)
(label gradecp already defined)
(label veteran already defined)
(label marital already defined)
(label ethnic already defined)
(label race already defined)
(label sex already defined)
(label smsarank already defined)
(label smsa70 already defined)
(label centcity already defined)
(label smsastat already defined)
(label state already defined)
(label intmonth already defined)
(label minsamp already defined)
(label prunecat already defined)
(label ptstat already defined)
(label ftpt79 already defined)
(label why35lw already defined)
(label absentlw already defined)
(label reasonlw already defined)
(label uhours35 already defined)
(label doinglw already defined)
(label activlwr already defined)
(label eligible already defined)
(label docc70 already defined)
(label dind already defined)
(label ind70 already defined)
(label esr already defined)
(label classer already defined)
(label class already defined)
(label I25d already defined)
(label I25c already defined)
(label I25b already defined)
(label I25a already defined)
(label paidhre already defined)
(label paidhr already defined)
(label relahh already defined)
(label gradecp already defined)
(label veteran already defined)
(label marital already defined)
(label ethnic already defined)
(label race already defined)
(label sex already defined)
(label smsarank already defined)
(label smsa70 already defined)
(label centcity already defined)
(label smsastat already defined)
(label state already defined)
(label intmonth already defined)
(label minsamp already defined)
(label prunecat already defined)
(label ptstat already defined)
(label ftpt79 already defined)
(label why35lw already defined)
(label absentlw already defined)
(label reasonlw already defined)
(label uhours35 already defined)
(label doinglw already defined)
(label activlwr already defined)
(label eligible already defined)
(label dind already defined)
(label esr already defined)
(label classer already defined)
(label class already defined)
(label I25d already defined)
(label I25c already defined)
(label I25b already defined)
(label I25a already defined)
(label paidhre already defined)
(label paidhr already defined)
(label relahh already defined)
(label gradecp already defined)
(label veteran already defined)
(label marital already defined)
(label ethnic already defined)
(label race already defined)
(label sex already defined)
(label smsarank already defined)
(label smsa70 already defined)
(label centcity already defined)
(label smsastat already defined)
(label state already defined)
(label intmonth already defined)
(label minsamp already defined)
(label prunecat already defined)
(label P40L already defined)
(label P36L already defined)

. 
. 
. // Make industry and occupation consistent (because no overlap)
. // Make consistent industry variable
. 
. /* New industry mapping
> 1 --> Agriculture/Forestry/Fishing/Hunting
> 2 --> Mining/Quarrying/OilExtraction
> 3 --> Construction
> 4 --> Manufacturing
> 5 --> Wholesale Trade
> 6 --> Retail Trade
> 7 --> Transportation and Warehousing
> 8 --> Utilities
> 9 --> Information/Communications
> 10 --> Finance/Insurance
> 11 --> Real Estate/Renting
> 12 --> Professional/Scientific/Technical Services
> 13 --> Management of Companies/Enterprises/Consulting
> 14 --> Administrative/Support/Waste Management Services
> 15 --> Education
> 16 --> Healthcare/Social Assistance
> 17 --> Arts/Entertainment/Recreation
> 18 --> Accomodation/Food Services
> 19 --> Other Services (e.g. car maintenance, beauty salons, religion, funeral homes)
> 20 --> Public Administration
> 21 --> Military
> */
. 
. gen occ = .
(2,121,540 missing values generated)

. gen ind = .
(2,121,540 missing values generated)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(22,474 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(5,845 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(33,601 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(96,590 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(19,558 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(93,615 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(20,411 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(6,711 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(6,616 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(22,089 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(8,031 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(9,816 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(946 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(25,193 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(40,078 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(46,581 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(7,939 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(8,908 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(15,312 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(24,525 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. // Dataset lacks a military industry but it's okay because they aren't paid hourly anyways
. replace ind = 1 if (year <= 1982) & ind70 <= 28
(49,205 real changes made)

. replace ind = 2 if (year <= 1982) & ind70 >= 47 & ind70 <= 57
(12,753 real changes made)

. replace ind = 3 if (year <= 1982) & ind70 >= 67 & ind70 <= 77
(68,929 real changes made)

. replace ind = 4 if (year <= 1982) & ind70 >= 107 & ind70 <= 398
(216,556 real changes made)

. replace ind = 5 if (year <= 1982) & ind70 >= 507 & ind70 <= 588
(38,603 real changes made)

. replace ind = 6 if (year <= 1982) & ind70 >= 607 & ind70 <= 698
(193,095 real changes made)

. replace ind = 7 if (year <= 1982) & ind70 >= 407 & ind70 <= 429
(38,193 real changes made)

. replace ind = 8 if (year <= 1982) & ind70 >= 467 & ind70 <= 479
(13,757 real changes made)

. replace ind = 9 if (year <= 1982) & ind70 >= 447 & ind70 <= 449
(13,981 real changes made)

. replace ind = 10 if (year <= 1982) & ind70 >= 707 & ind70 <= 717
(43,654 real changes made)

. replace ind = 11 if (year <= 1982) & ind70 == 718
(15,874 real changes made)

. replace ind = 12 if (year <= 1982) & ind70 >= 888 & ind70 <= 897 | ind70 == 849
(22,031 real changes made)

. replace ind = 13 if (year <= 1982) & ind70 == 738
(3,482 real changes made)

. replace ind = 14 if (year <= 1982) & ind70 >= 727 & ind70 <= 759
(42,387 real changes made)

. replace ind = 15 if (year <= 1982) & ind70 >= 857 & ind70 <= 868
(89,344 real changes made)

. replace ind = 16 if (year <= 1982) & ((ind70 >= 828 & ind70 <= 848) | ind70 >= 878 | ind70 == 879)
(513,603 real changes made)

. replace ind = 17 if (year <= 1982) & (ind70 >= 807 & ind70 <= 809 | ind70 == 869)
(14,751 real changes made)

. replace ind = 18 if (year <= 1982) & (ind70 == 777 | ind70 == 778)
(18,273 real changes made)

. replace ind = 19 if (year <= 1982) & ((ind70 >= 779 & ind70 <= 798) | ind70 == 877 | ind70 == 887)
(27,762 real changes made)

. replace ind = 20 if (year <= 1982) & ind70 >= 907 & ind70 <= 937
(57,929 real changes made)

. // replace ind = 21 if ...
. 
. drop if missing(ind)            // Drops 298 observations, all from older datasets
(193,929 observations deleted)

. 
. 
. 
. // Make a consistent new occupation variable
. 
. cap drop occ

. gen occ = .
(1,927,611 missing values generated)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(35,376 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(13,526 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(399,492 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(10,796 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(3,871 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(2,477 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(3,358 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(21,489 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(7,521 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(10,348 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(16,269 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(7,917 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(30,153 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(15,720 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(16,431 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(60,910 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(81,940 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(23,534 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(19,452 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(44,437 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(17,123 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(40 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(0 real changes made)

. 
. replace occ = 1 if (year <= 1982) & occ70 >= 201 & occ70 <= 245
(108,328 real changes made)

. replace occ = 2 if (year <= 1982) & (occ70 >= 55 & occ70 <= 56 | occ70 == 195 | occ70 == 26 | occ70 == 1)
(18,049 real changes made)

. replace occ = 3 if (year <= 1982) & occ70 >= 3 & occ70 <= 5 | occ70 >= 34 & occ70 <= 36
(5,577 real changes made)

. replace occ = 4 if (year <= 1982) & ((occ70 >= 6 & occ70 <= 23) | (occ70 >= 150 & occ70 <= 162) | occ70 == 2)
(24,567 real changes made)

. replace occ = 5 if (year <= 1982) & occ70 >= 42 & occ70 <= 54 | occ70 >= 91 & occ70 <= 96
(5,758 real changes made)

. replace occ = 6 if (year <= 1982) & (occ70 >= 86 & occ70 <= 90 | occ70 == 100 | occ70 == 174 | occ70 == 763) 
(8,798 real changes made)

. replace occ = 7 if (year <= 1982) & occ70 >= 30 & occ70 <= 31
(5,101 real changes made)

. replace occ = 8 if (year <= 1982) & occ70 >= 32 & occ70 <= 33 | occ70 >= 102 & occ70 <= 145
(42,495 real changes made)

. replace occ = 9 if (year <= 1982) & (occ70 >= 175 & occ70 <= 195 | occ70 == 101 | occ70 == 171)
(17,881 real changes made)

. replace occ = 10 if (year <= 1982) & (occ70 >= 61 & occ70 <= 73 | occ70 >= 80 & occ70 <= 83 | occ70 == 85) 
(13,045 real changes made)

. replace occ = 11 if (year <= 1982) & ((occ70 >= 74 & occ70 <= 76) | (occ70 >= 921 & occ70 <= 926) | occ70 == 84)
(38,833 real changes made)

. replace occ = 12 if (year <= 1982) & occ70 >= 960 & occ70 <= 965
(14,283 real changes made)

. replace occ = 13 if (year <= 1982) & occ70 >= 910 & occ70 <= 916
(62,272 real changes made)

. replace occ = 14 if (year <= 1982) & occ70 >= 901 & occ70 <= 903
(31,837 real changes made)

. replace occ = 15 if (year <= 1982) & (occ70 >= 931 & occ70 <= 954 | occ70 >= 980 & occ70 <= 984 | occ70 == 165 | occ70 == 7
> 40 | occ70 == 755)
(31,420 real changes made)

. replace occ = 16 if (year <= 1982) & occ70 >= 260 & occ70 <= 300
(68,269 real changes made)

. replace occ = 17 if (year <= 1982) & occ70 >= 301 & occ70 <= 395
(202,287 real changes made)

. replace occ = 18 if (year <= 1982) & (occ70 >= 801 & occ70 <= 824 | occ70 >= 24 & occ70 <= 25 | occ70 == 752 | occ70 == 761
> )
(42,132 real changes made)

. replace occ = 19 if (year <= 1982) & (occ70 >= 401 & occ70 <= 462 | occ70 == 750 | occ70 == 751) 
(77,707 real changes made)

. replace occ = 20 if (year <= 1982) & occ70 >= 470 & occ70 <= 575
(62,622 real changes made)

. replace occ = 21 if (year <= 1982) & occ70 >= 601 & occ70 <= 695 | occ70 >= 172 & occ70 <= 173
(117,667 real changes made)

. replace occ = 22 if (year <= 1982) & (occ70 >= 701 & occ70 <= 705 | occ70 >= 714 & occ70 <= 715 | occ70 >= 163 & occ70 <= 1
> 64 | occ70 == 170 | occ70 == 764)
(34,769 real changes made)

. replace occ = 23 if (year <= 1982) & (occ70 >= 706 & occ70 <= 713 | occ70 == 770 | occ70 == 762 | (occ70 >= 753 & occ70 <= 
> 754) | (occ70 >= 764 & occ70 <= 785))
(37,083 real changes made)

. replace occ = 24 if (year <= 1982) & occ70 == 580
(1 real change made)

. 
. drop if missing(occ)
(346,160 observations deleted)

. 
. //famnum, hrhtype, chldpres for 84+
. egen nobs = count(hhid) if hhnum == 1, by(hhid lineno hurespli intmonth race sex marital esr gradeat ind occ)
(145,772 missing values generated)

. keep if nobs == 2
(1,301,235 observations deleted)

. 
. egen id = group(hhid lineno hurespli intmonth race sex marital esr gradeat)
(14 missing values generated)

. 
. sort id minsamp

. 
. gen is_mis4 = (minsamp == 4)

. gen is_mis8 = (minsamp == 8)

. 
. bysort id: egen mis4 = total(is_mis4)

. bysort id: egen mis8 = total(is_mis8)

. 
. keep if (mis4 == 1 & mis8 == 1)
(5,994 observations deleted)

. 
. // There must be some error recording years...
. gen delete_flag = 1

. foreach year in 1979 1980 1981 1982 1983 {
  2.         
.         gen flag_minsamp4_`year' = (minsamp == 4 & year == `year')
  3.         gen flag_minsamp8_`year' = (minsamp == 8 & year == `year' + 1)
  4.         
.         bysort id: egen has_minsamp4_`year' = max(flag_minsamp4_`year')
  5.         bysort id: egen has_minsamp8_`year' = max(flag_minsamp8_`year')
  6.         
.         replace delete_flag = 0 if has_minsamp4_`year' == 1 & has_minsamp8_`year' == 1
  7.         
.         drop flag_minsamp4_`year'
  8.         drop flag_minsamp8_`year'
  9.         drop has_minsamp4_`year'
 10.         drop has_minsamp8_`year'
 11.         
. }
(53,378 real changes made)
(60,868 real changes made)
(58,966 real changes made)
(43,746 real changes made)
(55,914 real changes made)

. 
. drop if delete_flag == 1
(1,350 observations deleted)

. 
. tsset id year 

Panel variable: id (weakly balanced)
 Time variable: year, 1979 to 1984
         Delta: 1 unit

. 
. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(97,665 observations deleted)

. keep if I25b == 0
(1,289 observations deleted)

. 
. drop if earnhre == 9999
(1 observation deleted)

. drop if missing(earnhre)
(68,085 observations deleted)

. 
. rename classer class94

. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(11,846 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(93,986 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(46,993 missing values generated)

. drop if missing(lag_earnhre)
(46,993 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(8,239 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str6

. replace id = id + "_E"
variable id was str6 now str8
(38,754 real changes made)

. 
. save "cleaned_data_79to84.dta", replace
file cleaned_data_79to84.dta saved

. 
. 
. 
. 
. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_84.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg84.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 85 {
  2.         
.         append using "../CPS Raw/morg`year'.dta"
  3.         
. }
(label prunecat already defined)
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P65L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P63L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P62L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P280L already defined)
(label P66L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label P4L already defined)
(label P2L already defined)

. 
. gen occ = .
(687,256 missing values generated)

. gen ind = .
(687,256 missing values generated)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(20,445 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(5,319 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(33,727 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(96,138 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(19,135 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(93,244 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(20,597 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(6,557 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(6,755 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(22,531 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(8,146 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(10,370 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(983 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(26,934 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(39,580 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(45,997 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(7,713 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(8,689 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(14,992 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(24,058 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(37,303 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(14,107 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(567,035 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(11,061 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(3,888 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(4,008 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(3,494 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(21,658 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(7,976 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(10,115 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(16,202 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(7,813 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(29,824 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(15,712 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(16,435 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(61,589 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(83,162 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(21,537 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(19,618 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(43,262 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(17,085 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(45 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(442 real changes made)

. 
. 
. drop if missing(hurespli)
(2,870 observations deleted)

. 
. egen nobs = count(hhid) if hhnum == 1, by(hhid lineno hurespli intmonth race sex famnum /* hrhtype */ ind occ)
(54,525 missing values generated)

. keep if nobs == 2
(626,932 observations deleted)

. 
. egen id = group(hhid lineno hurespli intmonth race sex famnum /* hrhtype */)

. 
. sort id minsamp

. 
. gen is_mis4 = (minsamp == 4)

. gen is_mis8 = (minsamp == 8)

. 
. bysort id: egen mis4 = total(is_mis4)

. bysort id: egen mis8 = total(is_mis8)

. 
. keep if (mis4 == 1 & mis8 == 1)
(96 observations deleted)

. 
. // There must be some error recording years...
. gen delete_flag = 1

. foreach year in 1984 1985 {
  2.         
.         gen flag_minsamp4_`year' = (minsamp == 4 & year == `year')
  3.         gen flag_minsamp8_`year' = (minsamp == 8 & year == `year' + 1)
  4.         
.         bysort id: egen has_minsamp4_`year' = max(flag_minsamp4_`year')
  5.         bysort id: egen has_minsamp8_`year' = max(flag_minsamp8_`year')
  6.         
.         replace delete_flag = 0 if has_minsamp4_`year' == 1 & has_minsamp8_`year' == 1
  7.         
.         drop flag_minsamp4_`year'
  8.         drop flag_minsamp8_`year'
  9.         drop has_minsamp4_`year'
 10.         drop has_minsamp8_`year'
 11.         
. }
(57,264 real changes made)
(0 real changes made)

. 
. drop if delete_flag == 1
(94 observations deleted)

. drop delete_flag

. 
. tsset id year

Panel variable: id (strongly balanced)
 Time variable: year, 1984 to 1985
         Delta: 1 unit

. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(11,470 observations deleted)

. keep if I25b == 0
(181 observations deleted)

. 
. drop if earnhre == 9999
(0 observations deleted)

. drop if missing(earnhre)
(31,388 observations deleted)

. 
. rename classer class94

. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(2,385 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(11,840 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(5,920 missing values generated)

. drop if missing(lag_earnhre)
(5,920 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(992 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str5

. replace id = id + "_M"
variable id was str5 now str7
(4,928 real changes made)

. 
. save "cleaned_data_84to85.dta", replace
file cleaned_data_84to85.dta saved

. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_85.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg85.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 86 {
  2.         
.         append using "../CPS Raw/morg`year'.dta"
  3.         
. }
(label prunecat already defined)
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P65L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P63L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P62L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label P4L already defined)
(label P2L already defined)

. 
. 
. gen occ = .
(681,642 missing values generated)

. gen ind = .
(681,642 missing values generated)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(18,769 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(4,773 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(33,763 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(94,291 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(19,146 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(92,474 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(20,606 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(6,349 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(6,863 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(23,135 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(8,354 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(10,696 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(924 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(28,071 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(39,141 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(45,897 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(7,562 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(8,717 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(14,730 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(23,886 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(38,578 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(14,420 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(559,740 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(11,296 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(3,943 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(4,097 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(3,547 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(21,424 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(7,995 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(9,941 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(16,227 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(7,840 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(29,001 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(15,418 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(16,132 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(61,891 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(83,371 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(19,697 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(19,232 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(42,143 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(16,815 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(46 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(378 real changes made)

. 
. 
. drop if missing(hurespli)
(2,509 observations deleted)

. 
. egen nobs = count(hhid) if hhnum == 1, by(hhid lineno hurespli intmonth race sex famnum ind occ /* famnum hrhtype */)
(53,676 missing values generated)

. keep if nobs == 2
(648,823 observations deleted)

. 
. egen id = group(hhid lineno hurespli intmonth race sex famnum /* famnum hrhtype */)

. 
. sort id minsamp

. 
. /*
> gen is_mis4 = (minsamp == 4)
> gen is_mis8 = (minsamp == 8)
> 
> bysort id: egen mis4 = total(is_mis4)
> bysort id: egen mis8 = total(is_mis8)
> 
> keep if (mis4 == 1 & mis8 == 1)
> */
. 
. // There must be some error recording years...
. gen delete_flag = 1

. foreach year in 1985 1986 {
  2.         
.         gen flag_minsamp4_`year' = (minsamp == 4 & year == `year')
  3.         gen flag_minsamp8_`year' = (minsamp == 8 & year == `year' + 1)
  4.         
.         bysort id: egen has_minsamp4_`year' = max(flag_minsamp4_`year')
  5.         bysort id: egen has_minsamp8_`year' = max(flag_minsamp8_`year')
  6.         
.         replace delete_flag = 0 if has_minsamp4_`year' == 1 & has_minsamp8_`year' == 1
  7.         
.         drop flag_minsamp4_`year'
  8.         drop flag_minsamp8_`year'
  9.         drop has_minsamp4_`year'
 10.         drop has_minsamp8_`year'
 11.         
. }
(28,574 real changes made)
(0 real changes made)

. 
. drop if delete_flag == 1
(1,736 observations deleted)

. drop delete_flag

. 
. 
. tsset id year

Panel variable: id (strongly balanced)
 Time variable: year, 1985 to 1986
         Delta: 1 unit

. 
. keep if I25b == 0
(100 observations deleted)

. 
. // I think in general maybe impute earnhre from earnwke and uhourse if missing
. replace earnhre = earnwke / uhourse * 100 if missing(earnhre) & earnwke < 999
variable earnhre was int now float
(5,350 real changes made)

. drop if earnhre >= 9999
(15,914 observations deleted)

. drop if missing(earnhre)
(0 observations deleted)

. 
. rename classer class94

. 
. drop if missing(ind80)
(0 observations deleted)

. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(998 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
(11,562 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(5,781 missing values generated)

. drop if missing(lag_earnhre)
(5,781 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(1,447 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str5

. replace id = id + "_M"
variable id was str5 now str7
(4,334 real changes made)

. 
. save "cleaned_data_85to86.dta", replace
file cleaned_data_85to86.dta saved

. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_86.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg86.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 87 88 89 {
  2.         
.         append using "../CPS Raw/morg`year'.dta"
  3.         
. }
(label prunecat already defined)
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P65L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P63L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P62L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P45L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label P4L already defined)
(label P2L already defined)
(label prunecat already defined)
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P65L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P63L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P62L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P45L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label P4L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P62L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P45L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label P4L already defined)
(label P2L already defined)

. 
. 
. gen occ = .
(1,320,583 missing values generated)

. gen ind = .
(1,320,583 missing values generated)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(35,008 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(7,897 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(65,517 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(176,682 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(37,175 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(179,684 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(40,628 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(12,322 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(12,644 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(45,977 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(17,161 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(21,637 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(1,938 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(57,715 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(76,073 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(92,545 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(14,589 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(17,446 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(27,840 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(46,403 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(80,341 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(29,229 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(1,075,271 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(21,633 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(7,793 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(8,441 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(7,359 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(42,050 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(15,517 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(19,989 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(32,090 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(15,831 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(54,868 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(29,328 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(30,832 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(121,802 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(160,323 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(36,437 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(36,268 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(79,293 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(32,772 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(102 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(634 real changes made)

. 
. 
. drop if missing(hurespli)
(5,361 observations deleted)

. 
. egen nobs = count(hhid) if hhnum == 1, by(hhid lineno hurespli intmonth race sex famnum hrhtype chldpres marital esr gradea
> t ind occ)
(102,901 missing values generated)

. keep if nobs == 2
(1,170,926 observations deleted)

. 
. egen id = group(hhid lineno hurespli intmonth race sex famnum hrhtype chldpres marital esr gradeat)

. 
. sort id minsamp

. 
. gen is_mis4 = (minsamp == 4)

. gen is_mis8 = (minsamp == 8)

. 
. bysort id: egen mis4 = total(is_mis4)

. bysort id: egen mis8 = total(is_mis8)

. 
. keep if (mis4 == 1 & mis8 == 1)
(526 observations deleted)

. 
. // There must be some error recording years...
. gen delete_flag = 1

. foreach year in 1986 1987 1988 1989 {
  2.         
.         gen flag_minsamp4_`year' = (minsamp == 4 & year == `year')
  3.         gen flag_minsamp8_`year' = (minsamp == 8 & year == `year' + 1)
  4.         
.         bysort id: egen has_minsamp4_`year' = max(flag_minsamp4_`year')
  5.         bysort id: egen has_minsamp8_`year' = max(flag_minsamp8_`year')
  6.         
.         replace delete_flag = 0 if has_minsamp4_`year' == 1 & has_minsamp8_`year' == 1
  7.         
.         drop flag_minsamp4_`year'
  8.         drop flag_minsamp8_`year'
  9.         drop has_minsamp4_`year'
 10.         drop has_minsamp8_`year'
 11.         
. }
(74,500 real changes made)
(68,760 real changes made)
(0 real changes made)
(0 real changes made)

. 
. drop if delete_flag == 1
(510 observations deleted)

. 
. tsset id year

Panel variable: id (weakly balanced)
 Time variable: year, 1986 to 1988
         Delta: 1 unit

. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(31,198 observations deleted)

. keep if I25b == 0
(257 observations deleted)

. 
. drop if earnhre == 9999
(0 observations deleted)

. drop if missing(earnhre)
(74,455 observations deleted)

. 
. rename classer class94

. 
. drop if missing(ind80)
(0 observations deleted)

. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(4,002 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(33,348 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(16,674 missing values generated)

. drop if missing(lag_earnhre)
(16,674 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(2,746 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str5

. replace id = id + "_D"
variable id was str5 now str7
(13,928 real changes made)

. 
. save "cleaned_data_86to89.dta", replace
file cleaned_data_86to89.dta saved

. 
. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_88.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg88.dta", clear

. append using "../CPS Raw/morg89.dta"
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P62L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P45L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label P4L already defined)
(label P2L already defined)

. 
. 
. gen occ = .
(645,532 missing values generated)

. gen ind = .
(645,532 missing values generated)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(17,048 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(3,615 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(31,959 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(85,179 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(18,090 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(87,649 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(19,980 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(6,120 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(6,051 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(22,462 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(8,452 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(10,761 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(987 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(29,115 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(37,580 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(46,118 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(7,127 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(8,693 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(13,360 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(22,857 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(40,855 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(14,484 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(522,968 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(10,569 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(3,891 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(4,188 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(3,715 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(21,031 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(7,542 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(10,058 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(15,764 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(7,798 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(26,425 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(14,255 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(15,045 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(59,596 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(77,612 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(17,660 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(17,809 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(38,219 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(16,107 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(49 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(298 real changes made)

. 
. 
. drop if missing(hurespli)
(2,825 observations deleted)

. 
. egen nobs = count(hhid) if hhnum == 1, by(hhid lineno hurespli intmonth famnum race sex ind occ)
(49,298 missing values generated)

. keep if nobs == 2
(535,559 observations deleted)

. 
. egen id = group(hhid lineno hurespli intmonth famnum race sex)

. 
. sort id minsamp

. 
. gen is_mis4 = (minsamp == 4)

. gen is_mis8 = (minsamp == 8)

. 
. bysort id: egen mis4 = total(is_mis4)

. bysort id: egen mis8 = total(is_mis8)

. 
. keep if (mis4 == 1 & mis8 == 1)
(46 observations deleted)

. 
. // There must be some error recording years...
. gen delete_flag = 1 

. foreach year in 1988 /*  1989 1990 1991 1992 */ {
  2.         
.         gen flag_minsamp4_`year' = (minsamp == 4 & year == `year')
  3.         gen flag_minsamp8_`year' = (minsamp == 8 & year == `year' + 1)
  4.         
.         bysort id: egen has_minsamp4_`year' = max(flag_minsamp4_`year')
  5.         bysort id: egen has_minsamp8_`year' = max(flag_minsamp8_`year')
  6.         
.         replace delete_flag = 0 if has_minsamp4_`year' == 1 & has_minsamp8_`year' == 1
  7.         
.         drop flag_minsamp4_`year'
  8.         drop flag_minsamp8_`year'
  9.         drop has_minsamp4_`year'
 10.         drop has_minsamp8_`year'
 11.         
. }
(101,638 real changes made)

. 
. drop if delete_flag == 1
(5,464 observations deleted)

. 
. tsset id year 

Panel variable: id (strongly balanced)
 Time variable: year, 1988 to 1989
         Delta: 1 unit

. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(20,501 observations deleted)

. keep if I25b == 0
(276 observations deleted)

. 
. drop if earnhre == 9999
(0 observations deleted)

. drop if missing(earnhre)
(54,023 observations deleted)

. 
. rename classer class94

. 
. drop if missing(ind80)
(0 observations deleted)

. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(4,170 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(22,668 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(11,334 missing values generated)

. drop if missing(lag_earnhre)
(11,334 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(1,861 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str5

. replace id = id + "_G"
variable id was str5 now str7
(9,473 real changes made)

. 
. save "cleaned_data_88to89.dta", replace
file cleaned_data_88to89.dta saved

. 
. 
. 
. 
. 
. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_89.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg89.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 90 91 92 93 {
  2.         
.         append using "../CPS Raw/morg`year'.dta"
  3.         
. }
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P52L already defined)
(label P19L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P62L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label P41L already defined)
(label P45L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P52L already defined)
(label P19L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P62L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label P41L already defined)
(label P45L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P52L already defined)
(label P19L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label P41L already defined)
(label P45L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P60L already defined)
(label P24L already defined)
(label P59L already defined)
(label P58L already defined)
(label P57L already defined)
(label P56L already defined)
(label P55L already defined)
(label P54L already defined)
(label P53L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P52L already defined)
(label P19L already defined)
(label P61L already defined)
(label P51L already defined)
(label P50L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P48L already defined)
(label P42L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label P41L already defined)
(label P45L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P2L already defined)

. 
. 
. gen occ = .
(1,663,791 missing values generated)

. gen ind = .
(1,663,791 missing values generated)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(41,025 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(8,356 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(79,212 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(209,970 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(46,205 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(224,662 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(51,572 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(15,754 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(15,116 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(57,336 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(21,023 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(31,164 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(3,595 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(73,990 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(98,583 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(129,093 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(21,714 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(21,052 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(32,879 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(57,906 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(82,813 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(38,494 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(1,338,963 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(26,730 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(10,783 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(11,166 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(9,802 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(55,915 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(20,332 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(27,956 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(42,226 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(20,312 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(68,033 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(36,342 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(39,026 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(152,655 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(198,433 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(42,368 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(43,760 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(93,982 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(41,187 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(80 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(762 real changes made)

. 
. 
. drop if missing(hurespli)
(6,210 observations deleted)

. 
. egen nobs = count(hhid) if hhnum == 1, by(hhid lineno hurespli intmonth famnum race sex hrhtype relaref marital chldpres in
> d occ)
(129,632 missing values generated)

. keep if nobs == 2
(1,292,109 observations deleted)

. 
. egen id = group(hhid lineno hurespli intmonth famnum race sex hrhtype relaref marital chldpres)

. 
. sort id minsamp

. 
. gen is_mis4 = (minsamp == 4)

. gen is_mis8 = (minsamp == 8)

. 
. bysort id: egen mis4 = total(is_mis4)

. bysort id: egen mis8 = total(is_mis8)

. 
. keep if (mis4 == 1 & mis8 == 1)
(11,668 observations deleted)

. 
. // There must be some error recording years...
. gen delete_flag = 1 

. foreach year in 1989 1990 1991 1992 {
  2.         
.         gen flag_minsamp4_`year' = (minsamp == 4 & year == `year')
  3.         gen flag_minsamp8_`year' = (minsamp == 8 & year == `year' + 1)
  4.         
.         bysort id: egen has_minsamp4_`year' = max(flag_minsamp4_`year')
  5.         bysort id: egen has_minsamp8_`year' = max(flag_minsamp8_`year')
  6.         
.         replace delete_flag = 0 if has_minsamp4_`year' == 1 & has_minsamp8_`year' == 1
  7.         
.         drop flag_minsamp4_`year'
  8.         drop flag_minsamp8_`year'
  9.         drop has_minsamp4_`year'
 10.         drop has_minsamp8_`year'
 11.         
. }
(86,548 real changes made)
(89,936 real changes made)
(84,986 real changes made)
(87,636 real changes made)

. 
. drop if delete_flag == 1
(4,698 observations deleted)

. 
. tsset id year 

Panel variable: id (weakly balanced)
 Time variable: year, 1989 to 1993
         Delta: 1 unit

. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(68,535 observations deleted)

. keep if I25b == 0
(2,083 observations deleted)

. 
. drop if earnhre == 9999
(3 observations deleted)

. drop if missing(earnhre)
(187,065 observations deleted)

. 
. rename classer class94

. 
. drop if missing(ind80)
(0 observations deleted)

. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(14,496 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(76,924 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(38,462 missing values generated)

. drop if missing(lag_earnhre)
(38,462 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(6,588 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str6

. replace id = id + "_C"
variable id was str6 now str8
(31,874 real changes made)

. 
. save "cleaned_data_89to93.dta", replace
file cleaned_data_89to93.dta saved

. 
. 
. 
. 
. 
. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_93.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg93.dta", clear

. append using "../CPS Raw/morg94.dta"
(label hrhtype already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P19L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P42L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label P41L already defined)
(label P45L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P2L already defined)

. 
. 
. gen occ = .
(647,319 missing values generated)

. gen ind = .
(647,319 missing values generated)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(15,088 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(2,874 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(28,753 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(73,806 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(16,968 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(82,922 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(19,795 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(5,678 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(5,498 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(21,237 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(7,607 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(13,150 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(2,093 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(26,509 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(37,646 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(51,837 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(9,420 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(6,656 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(11,778 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(21,388 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(18,078 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(15,028 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(520,724 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(9,948 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(4,577 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(4,333 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(3,952 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(21,773 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(7,818 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(11,309 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(16,228 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(7,893 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(25,311 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(12,611 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(14,985 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(56,231 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(71,906 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(15,590 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(15,857 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(32,789 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(15,445 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(0 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(240 real changes made)

. 
. 
. keep if hhnum == 1
(48,169 observations deleted)

. egen nobs = count(hhid), by(hhid lineno hurespli intmonth race sex famnum hrhtype occ ind) 

. 
. keep if nobs == 2
(498,994 observations deleted)

. 
. egen id = group(hhid lineno hurespli intmonth race sex famnum hrhtype)

. 
. sort id minsamp

. 
. gen is_mis4 = (minsamp == 4)

. gen is_mis8 = (minsamp == 8)

. 
. bysort id: egen mis4 = total(is_mis4)

. bysort id: egen mis8 = total(is_mis8)

. 
. keep if (mis4 == 1 & mis8 == 1)
(1,704 observations deleted)

. 
. // There must be some error recording years...
. gen delete_flag = 1 

. gen flag_minsamp4 = (minsamp == 4 & year == 1993)

. gen flag_minsamp8 = (minsamp == 8 & year == 1994)

.         
. bysort id: egen has_minsamp4 = max(flag_minsamp4)

. bysort id: egen has_minsamp8 = max(flag_minsamp8)

.         
. replace delete_flag = 0 if has_minsamp4 == 1 & has_minsamp8 == 1
(95,576 real changes made)

. 
. drop flag_minsamp4

. drop flag_minsamp8

. drop has_minsamp4

. drop has_minsamp8

. 
. 
. drop if delete_flag == 1
(2,876 observations deleted)

. 
. tsset id year 

Panel variable: id (strongly balanced)
 Time variable: year, 1993 to 1994
         Delta: 1 unit

. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(19,529 observations deleted)

. keep if I25b == 0
(993 observations deleted)

. 
. drop if earnhre == 9999
(2 observations deleted)

. drop if missing(earnhre)
(49,986 observations deleted)

. 
. drop if missing(ind80)
(0 observations deleted)

. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(4,684 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(20,382 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(10,191 missing values generated)

. drop if missing(lag_earnhre)
(10,191 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(1,879 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str5

. replace id = id + "_F"
variable id was str5 now str7
(8,312 real changes made)

. 
. save "cleaned_data_93to94.dta", replace
file cleaned_data_93to94.dta saved

. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_94.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg94.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 95 96 {
  2.         
.         append using "../CPS Raw/morg`year'.dta"
  3.         
. }
(variable hhid was str12, now str15 to accommodate using data's values)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P19L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P42L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P19L already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label msafips already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)

. 
. 
. gen occ = .
(911,441 missing values generated)

. gen ind = .
(911,441 missing values generated)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(20,664 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(3,820 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(39,628 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(97,044 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(23,379 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(110,963 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(26,989 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(7,320 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(7,529 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(28,520 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(10,259 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(17,907 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(3,561 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(37,674 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(51,050 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(70,549 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(13,024 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(8,755 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(15,097 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(29,164 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(26,302 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(20,832 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(731,283 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(13,936 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(6,215 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(6,407 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(5,750 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(30,018 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(10,898 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(15,973 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(22,082 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(10,613 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(32,898 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(16,324 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(19,837 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(76,548 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(93,191 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(20,867 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(21,345 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(43,097 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(20,674 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(0 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(187 real changes made)

. 
. 
. keep if hhnum == 1
(56,105 observations deleted)

. egen nobs = count(hhid), by(hhid lineno hrsample hurespli race sex grade92 famnum) 

. keep if nobs == 2
(756,724 observations deleted)

. // drop nobs
. 
. // drop hrhhid2 out of this just because they only start appearing in '04 and '04 doesn't get matched here
. // we need a way to match '04 to '05
. egen id = group(hhid lineno hrsample hurespli race sex grade92 famnum)

. 
. 
. gen delete_flag = 1

. foreach year in 1994 1995 {
  2.         
.         gen flag_minsamp4_`year' = (minsamp == 4 & year == `year')
  3.         gen flag_minsamp8_`year' = (minsamp == 8 & year == `year' + 1)
  4.         
.         bysort id: egen has_minsamp4_`year' = max(flag_minsamp4_`year')
  5.         bysort id: egen has_minsamp8_`year' = max(flag_minsamp8_`year')
  6.         
.         replace delete_flag = 0 if has_minsamp4_`year' == 1 & has_minsamp8_`year' == 1
  7.         
.         drop flag_minsamp4_`year'
  8.         drop flag_minsamp8_`year'
  9.         drop has_minsamp4_`year'
 10.         drop has_minsamp8_`year'
 11.         
. }
(53,608 real changes made)
(38,288 real changes made)

. 
. drop if delete_flag == 1
(6,716 observations deleted)

. drop delete_flag

. 
. tsset id year

Panel variable: id (weakly balanced)
 Time variable: year, 1994 to 1996
         Delta: 1 unit

. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(20,240 observations deleted)

. keep if I25b == 0
(2,067 observations deleted)

. 
. replace earnhre = earnwke / uhourse * 100 if missing(earnhre) & earnwke < 999
variable earnhre was int now float
(31 real changes made)

. drop if earnhre >= 9999
(44,184 observations deleted)

. drop if missing(earnhre)
(0 observations deleted)

. 
. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(6,555 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
(18,835 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(9,425 missing values generated)

. drop if missing(lag_earnhre)
(9,425 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)
(14 missing values generated)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(1,970 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str5

. replace id = id + "_O"
variable id was str5 now str7
(7,455 real changes made)

. 
. save "cleaned_data_94to96.dta", replace
file cleaned_data_94to96.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. do "./Data/CPS Clean/construct_96.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/CPS Clean

. 
. use "../CPS Raw/morg96.dta", clear

. 
. 
. // Concatenate all years of data into one dataset
. foreach year in 97 98 99 00 01 /* 02 03 04 */ {
  2.         
.         append using "../CPS Raw/morg`year'.dta"
  3.         
. }
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label msafips already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(variable earnwt was float, now double to accommodate using data's values)
(variable weight was float, now double to accommodate using data's values)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label msafips already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label P40L already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label msafips already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label occ80_97 already defined)
(label P37L already defined)
(label P36L already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label msafips already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label docc80l already defined)
(label occ00l already defined)
(label occ80_97 already defined)
(label dind02 already defined)
(label P37L already defined)
(label ind02l already defined)
(label P36L already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label P13L already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label P8L already defined)
(label msafips already defined)
(label P7L already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)

. 
. 
. gen occ = .
(1,707,891 missing values generated)

. gen ind = .
(1,707,891 missing values generated)

. 
. replace ind = 1 if (year >= 2000 & year <= 2019) & ind02 <= 290
(9,071 real changes made)

. replace ind = 2 if (year >= 2000 & year <= 2019) & ind02 >= 370 & ind02 <= 490
(2,112 real changes made)

. replace ind = 3 if (year >= 2000 & year <= 2019) & ind02 == 770
(29,711 real changes made)

. replace ind = 4 if (year >= 2000 & year <= 2019) & ind02 >= 1070 & ind02 <= 3990
(53,074 real changes made)

. replace ind = 5 if (year >= 2000 & year <= 2019) & ind02 >= 4070 & ind02 <= 4590
(11,831 real changes made)

. replace ind = 6 if (year >= 2000 & year <= 2019) & ind02 >= 4690 & ind02 <= 5790
(44,112 real changes made)

. replace ind = 7 if (year >= 2000 & year <= 2019) & ind02 >= 6070 & ind02 <= 6390
(17,436 real changes made)

. replace ind = 8 if (year >= 2000 & year <= 2019) & ind02 >= 570 & ind02 <= 690
(3,824 real changes made)

. replace ind = 9 if (year >= 2000 & year <= 2019) & ind02 >= 6470 & ind02 <= 6780
(11,167 real changes made)

. replace ind = 10 if (year >= 2000 & year <= 2019) & ind02 >= 6870 & ind02 <= 6990
(19,379 real changes made)

. replace ind = 11 if (year >= 2000 & year <= 2019) & ind02 >= 7070 & ind02 <= 7190
(7,876 real changes made)

. replace ind = 12 if (year >= 2000 & year <= 2019) & ind02 >= 7270 & ind02 <= 7490
(23,918 real changes made)

. replace ind = 13 if (year >= 2000 & year <= 2019) & ind02 == 7570
(119 real changes made)

. replace ind = 14 if (year >= 2000 & year <= 2019) & ind02 >= 7580 & ind02 <= 7790
(16,705 real changes made)

. replace ind = 15 if (year >= 2000 & year <= 2019) & ind02 >= 7860 & ind02 <= 7890
(34,877 real changes made)

. replace ind = 16 if (year >= 2000 & year <= 2019) & ind02 >= 7970 & ind02 <= 8470
(45,440 real changes made)

. replace ind = 17 if (year >= 2000 & year <= 2019) & ind02 >= 8560 & ind02 <= 8590
(8,514 real changes made)

. replace ind = 18 if (year >= 2000 & year <= 2019) & ind02 >= 8660 & ind02 <= 8690 
(28,379 real changes made)

. replace ind = 19 if (year >= 2000 & year <= 2019) & ind02 >= 8770 & ind02 <= 9290
(19,164 real changes made)

. replace ind = 20 if (year >= 2000 & year <= 2019) & ind02 >= 9370 & ind02 <= 9590
(18,906 real changes made)

. replace ind = 21 if (year >= 2000 & year <= 2019) & ind02 >= 9670 & ind02 <= 9870
(0 real changes made)

. 
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(24,470 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(4,635 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(50,857 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(114,210 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(28,567 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(136,498 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(34,075 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(8,657 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(9,882 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(35,525 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(13,032 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(23,430 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(5,071 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(50,417 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(63,836 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(88,281 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(16,946 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(10,802 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(19,079 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(35,200 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(34,138 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(26,520 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(890,012 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(20,281 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(9,766 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(8,108 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(7,568 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(38,537 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(14,224 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(27,546 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(27,711 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(13,286 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(39,603 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(19,928 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(26,646 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(95,372 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(110,690 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(24,433 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(26,923 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(50,286 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(25,938 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(0 real changes made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(189 real changes made)

. 
. replace occ = 1 if (year >= 2000 & year <= 2010) & occ00 <= 430
(42,247 real changes made)

. replace occ = 2 if (year >= 2000 & year <= 2010) & occ00 >= 500 & occ00 <= 950
(15,185 real changes made)

. replace occ = 3 if (year >= 2000 & year <= 2010) & occ00 >= 1000 & occ00 <= 1240
(8,911 real changes made)

. replace occ = 4 if (year >= 2000 & year <= 2010) & occ00 >= 1300 & occ00 <= 1560
(6,586 real changes made)

. replace occ = 5 if (year >= 2000 & year <= 2010) & occ00 >= 1600 & occ00 <= 1960
(2,683 real changes made)

. replace occ = 6 if (year >= 2000 & year <= 2010) & occ00 >= 2000 & occ00 <= 2060
(5,793 real changes made)

. replace occ = 7 if (year >= 2000 & year <= 2010) & occ00 >= 2100 & occ00 <= 2150
(4,238 real changes made)

. replace occ = 8 if (year >= 2000 & year <= 2010) & occ00 >= 2200 & occ00 <= 2550
(22,379 real changes made)

. replace occ = 9 if (year >= 2000 & year <= 2010) & occ00 >= 2600 & occ00 <= 2960
(8,020 real changes made)

. replace occ = 10 if (year >= 2000 & year <= 2010) & occ00 >= 3000 & occ00 <= 3540
(11,668 real changes made)

. replace occ = 11 if (year >= 2000 & year <= 2010) & occ00 >= 3600 & occ00 <= 3650
(7,602 real changes made)

. replace occ = 12 if (year >= 2000 & year <= 2010) & occ00 >= 3700 & occ00 <= 3950
(7,688 real changes made)

. replace occ = 13 if (year >= 2000 & year <= 2010) & occ00 >= 4000 & occ00 <= 4160
(21,882 real changes made)

. replace occ = 14 if (year >= 2000 & year <= 2010) & occ00 >= 4200 & occ00 <= 4250
(15,600 real changes made)

. replace occ = 15 if (year >= 2000 & year <= 2010) & occ00 >= 4300 & occ00 <= 4650
(12,240 real changes made)

. replace occ = 16 if (year >= 2000 & year <= 2010) & occ00 >= 4700 & occ00 <= 4960
(47,228 real changes made)

. replace occ = 17 if (year >= 2000 & year <= 2010) & occ00 >= 5000 & occ00 <= 5930
(61,466 real changes made)

. replace occ = 18 if (year >= 2000 & year <= 2010) & occ00 >= 6000 & occ00 <= 6130
(3,990 real changes made)

. replace occ = 19 if (year >= 2000 & year <= 2010) & occ00 >= 6200 & occ00 <= 6940
(23,513 real changes made)

. replace occ = 20 if (year >= 2000 & year <= 2010) & occ00 >= 7000 & occ00 <= 7620
(13,705 real changes made)

. replace occ = 21 if (year >= 2000 & year <= 2010) & occ00 >= 7700 & occ00 <= 8960
(32,002 real changes made)

. replace occ = 22 if (year >= 2000 & year <= 2010) & occ00 >= 9000 & occ00 <= 9420
(14,573 real changes made)

. replace occ = 23 if (year >= 2000 & year <= 2010) & occ00 >= 9500 & occ00 <= 9750
(11,091 real changes made)

. replace occ = 24 if (year >= 2000 & year <= 2010) & occ00 >= 9800
(176,103 real changes made)

. 
. 
. keep if hhnum == 1
(90,309 observations deleted)

. egen nobs = count(hhid), by(hhid /* hrhhid2 */ lineno hrsample hurespli ind occ) 

. keep if nobs == 2
(1,213,346 observations deleted)

. // drop nobs
. 
. // drop hrhhid2 out of this just because they only start appearing in '04 and '04 doesn't get matched here
. // we need a way to match '04 to '05
. egen id = group(hhid lineno hrsample hurespli)

. 
. sort id minsamp

. 
. gen is_mis4 = (minsamp == 4)

. gen is_mis8 = (minsamp == 8)

. 
. bysort id: egen mis4 = total(is_mis4)

. bysort id: egen mis8 = total(is_mis8)

. 
. keep if (mis4 == 1 & mis8 == 1)
(32 observations deleted)

. 
. tsset id year

Panel variable: id (weakly balanced)
 Time variable: year, 1996 to 2001
         Delta: 1 unit

. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(85,284 observations deleted)

. keep if I25b == 0
(10,872 observations deleted)

. 
. drop if earnhre == 9999
(5 observations deleted)

. drop if missing(earnhre)
(207,859 observations deleted)

.         
. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(20,876 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(79,308 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(39,654 missing values generated)

. drop if missing(lag_earnhre)
(39,654 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(7,725 observations deleted)

. 
. // Make sure there are no overlapping IDs when we need to concatenate
. tostring id, replace
id was float now str6

. replace id = id + "_B"
variable id was str6 now str8
(31,929 real changes made)

. 
. save "cleaned_data_96to01.dta", replace
file cleaned_data_96to01.dta saved

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. 
. do "./Data/compile.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper/Data

. 
. use "./CPS Clean/cleaned_data_04to23.dta", clear

. append using "./CPS Clean/cleaned_data_01to04.dta"
(label smsa04 already defined)
(label cbsafips already defined)
(label P2L already defined)
(label P3L already defined)
(label P4L already defined)
(label stfips already defined)
(label P27L already defined)
(label P5L already defined)
(label P6L already defined)
(label P7L already defined)
(label msafips already defined)
(label P8L already defined)
(label P9L already defined)
(label P10L already defined)
(label P11L already defined)
(label P12L already defined)
(label P30L already defined)
(label ch02 already defined)
(label ch35 already defined)
(label ch05 already defined)
(label ch613 already defined)
(label ch1417 already defined)
(label P47L already defined)
(label P13L already defined)
(label P14L already defined)
(label P15L already defined)
(label native already defined)
(label P16L already defined)
(label P34L already defined)
(label P17L already defined)
(label P18L already defined)
(label P28L already defined)
(label P29L already defined)
(label I25c already defined)
(label I25d already defined)
(label P19L already defined)
(label P20L already defined)
(label dind02 already defined)
(label occ00l already defined)
(label docc00l already defined)
(label P21L already defined)
(label P22L already defined)
(label P23L already defined)
(label P3594L already defined)
(label P160L already defined)
(label P24L already defined)
(label P25L already defined)
(label P26L already defined)
(label yesno already defined)
(label hrhtype already defined)
(label uhourse already defined)

. append using "./CPS Clean/cleaned_data_96to01.dta"
(label ind02l already defined)
(label dind02 already defined)
(label occ00l already defined)
(label docc00l already defined)
(label P30L already defined)
(label ch02 already defined)
(label ch35 already defined)
(label ch05 already defined)
(label ch613 already defined)
(label ch1417 already defined)
(label P2L already defined)
(label P3L already defined)
(label P4L already defined)
(label stfips already defined)
(label P27L already defined)
(label P5L already defined)
(label P6L already defined)
(label P7L already defined)
(label msafips already defined)
(label P8L already defined)
(label P9L already defined)
(label P10L already defined)
(label P11L already defined)
(label P12L already defined)
(label P47L already defined)
(label P13L already defined)
(label P14L already defined)
(label P15L already defined)
(label native already defined)
(label P16L already defined)
(label P34L already defined)
(label P17L already defined)
(label P18L already defined)
(label P28L already defined)
(label P29L already defined)
(label I25c already defined)
(label I25d already defined)
(label P19L already defined)
(label P20L already defined)
(label P36L already defined)
(label P37L already defined)
(label P21L already defined)
(label P22L already defined)
(label P23L already defined)
(label P3594L already defined)
(label P160L already defined)
(label P24L already defined)
(label P25L already defined)
(label P26L already defined)
(label yesno already defined)
(label hrhtype already defined)
(label uhourse already defined)

. append using "./CPS Clean/cleaned_data_94to96.dta"
(label P15L already defined)
(label P2L already defined)
(label P3L already defined)
(label P4L already defined)
(label stfips already defined)
(label P27L already defined)
(label P5L already defined)
(label P6L already defined)
(label P7L already defined)
(label P8L already defined)
(label P9L already defined)
(label P10L already defined)
(label P11L already defined)
(label P12L already defined)
(label P47L already defined)
(label P13L already defined)
(label P14L already defined)
(label native already defined)
(label P16L already defined)
(label P34L already defined)
(label P17L already defined)
(label P18L already defined)
(label P28L already defined)
(label P29L already defined)
(label P19L already defined)
(label P20L already defined)
(label P36L already defined)
(label P37L already defined)
(label P40L already defined)
(label P21L already defined)
(label P22L already defined)
(label P23L already defined)
(label P3594L already defined)
(label P160L already defined)
(label P24L already defined)
(label P25L already defined)
(label P26L already defined)
(label yesno already defined)
(label hrhtype already defined)
(label uhourse already defined)

. append using "./CPS Clean/cleaned_data_93to94.dta"
(label P3L already defined)
(label native already defined)
(label P16L already defined)
(label P34L already defined)
(label P17L already defined)
(label P22L already defined)
(label P23L already defined)
(label P3594L already defined)
(label P160L already defined)
(label yesno already defined)
(label P2L already defined)
(label P4L already defined)
(label stfips already defined)
(label P27L already defined)
(label P5L already defined)
(label P6L already defined)
(label P7L already defined)
(label P45L already defined)
(label P41L already defined)
(label P8L already defined)
(label P9L already defined)
(label P10L already defined)
(label P11L already defined)
(label P12L already defined)
(label P30L already defined)
(label ch02 already defined)
(label ch35 already defined)
(label ch05 already defined)
(label ch613 already defined)
(label ch1417 already defined)
(label P47L already defined)
(label P13L already defined)
(label P14L already defined)
(label P42L already defined)
(label P18L already defined)
(label P28L already defined)
(label P29L already defined)
(label P19L already defined)
(label P20L already defined)
(label P36L already defined)
(label P37L already defined)
(label P40L already defined)
(label P21L already defined)
(label P24L already defined)
(label P25L already defined)
(label P26L already defined)
(label hrhtype already defined)

. append using "./CPS Clean/cleaned_data_89to93.dta"
(label P14L already defined)
(label P2L already defined)
(label P4L already defined)
(label stfips already defined)
(label P27L already defined)
(label P5L already defined)
(label P6L already defined)
(label P7L already defined)
(label P45L already defined)
(label P41L already defined)
(label P8L already defined)
(label P9L already defined)
(label P10L already defined)
(label P11L already defined)
(label P12L already defined)
(label P30L already defined)
(label ch02 already defined)
(label ch35 already defined)
(label ch05 already defined)
(label ch613 already defined)
(label ch1417 already defined)
(label P47L already defined)
(label P13L already defined)
(label P42L already defined)
(label P48L already defined)
(label P18L already defined)
(label P28L already defined)
(label P29L already defined)
(label P50L already defined)
(label P51L already defined)
(label P61L already defined)
(label P19L already defined)
(label P52L already defined)
(label P20L already defined)
(label P36L already defined)
(label P37L already defined)
(label P40L already defined)
(label P21L already defined)
(label P53L already defined)
(label P54L already defined)
(label P55L already defined)
(label P56L already defined)
(label P57L already defined)
(label P58L already defined)
(label P59L already defined)
(label P24L already defined)
(label P60L already defined)
(label P25L already defined)
(label P26L already defined)
(label hrhtype already defined)

. append using "./CPS Clean/cleaned_data_88to89.dta"
(label stfips already defined)
(label P41L already defined)
(label P8L already defined)
(label ch02 already defined)
(label ch35 already defined)
(label P52L already defined)
(label P2L already defined)
(label P4L already defined)
(label P27L already defined)
(label P5L already defined)
(label P6L already defined)
(label P7L already defined)
(label P45L already defined)
(label P9L already defined)
(label P10L already defined)
(label P11L already defined)
(label P12L already defined)
(label P30L already defined)
(label ch05 already defined)
(label ch613 already defined)
(label ch1417 already defined)
(label P47L already defined)
(label P13L already defined)
(label P62L already defined)
(label P42L already defined)
(label P48L already defined)
(label P18L already defined)
(label P28L already defined)
(label P29L already defined)
(label P50L already defined)
(label P51L already defined)
(label P61L already defined)
(label P20L already defined)
(label P36L already defined)
(label P37L already defined)
(label P40L already defined)
(label P21L already defined)
(label P53L already defined)
(label P54L already defined)
(label P55L already defined)
(label P56L already defined)
(label P57L already defined)
(label P58L already defined)
(label P59L already defined)
(label P24L already defined)
(label P60L already defined)
(label P25L already defined)
(label P26L already defined)
(label hrhtype already defined)

. append using "./CPS Clean/cleaned_data_86to89.dta"
(label stfips already defined)
(label P41L already defined)
(label P8L already defined)
(label ch02 already defined)
(label ch35 already defined)
(label P52L already defined)
(label P2L already defined)
(label P4L already defined)
(label P27L already defined)
(label P5L already defined)
(label P6L already defined)
(label P7L already defined)
(label P45L already defined)
(label P9L already defined)
(label P10L already defined)
(label P11L already defined)
(label P12L already defined)
(label P30L already defined)
(label ch05 already defined)
(label ch613 already defined)
(label ch1417 already defined)
(label P47L already defined)
(label P13L already defined)
(label P62L already defined)
(label P42L already defined)
(label P48L already defined)
(label P18L already defined)
(label P28L already defined)
(label P29L already defined)
(label P50L already defined)
(label P51L already defined)
(label P61L already defined)
(label P63L already defined)
(label P20L already defined)
(label P36L already defined)
(label P37L already defined)
(label P40L already defined)
(label P21L already defined)
(label P53L already defined)
(label P54L already defined)
(label P55L already defined)
(label P56L already defined)
(label P57L already defined)
(label P58L already defined)
(label P59L already defined)
(label P65L already defined)
(label P24L already defined)
(label P60L already defined)
(label P25L already defined)
(label P26L already defined)
(label hrhtype already defined)
(label prunecat already defined)

. append using "./CPS Clean/cleaned_data_85to86.dta"
(label P45L already defined)
(label P2L already defined)
(label P4L already defined)
(label P27L already defined)
(label P5L already defined)
(label P6L already defined)
(label P7L already defined)
(label P9L already defined)
(label P10L already defined)
(label P11L already defined)
(label P12L already defined)
(label P30L already defined)
(label ch05 already defined)
(label ch613 already defined)
(label ch1417 already defined)
(label P47L already defined)
(label P13L already defined)
(label P62L already defined)
(label P42L already defined)
(label P48L already defined)
(label P18L already defined)
(label P28L already defined)
(label P29L already defined)
(label P50L already defined)
(label P51L already defined)
(label P61L already defined)
(label P63L already defined)
(label P20L already defined)
(label P36L already defined)
(label P37L already defined)
(label P40L already defined)
(label P21L already defined)
(label P53L already defined)
(label P54L already defined)
(label P55L already defined)
(label P56L already defined)
(label P57L already defined)
(label P58L already defined)
(label P59L already defined)
(label P65L already defined)
(label P24L already defined)
(label P60L already defined)
(label P25L already defined)
(label P26L already defined)
(label hrhtype already defined)
(label prunecat already defined)

. append using "./CPS Clean/cleaned_data_84to85.dta"
(label P7L already defined)
(label P2L already defined)
(label P4L already defined)
(label P27L already defined)
(label P5L already defined)
(label P6L already defined)
(label P66L already defined)
(label P280L already defined)
(label P9L already defined)
(label P10L already defined)
(label P11L already defined)
(label P12L already defined)
(label P30L already defined)
(label ch05 already defined)
(label ch613 already defined)
(label ch1417 already defined)
(label P47L already defined)
(label P13L already defined)
(label P62L already defined)
(label P42L already defined)
(label P48L already defined)
(label P18L already defined)
(label P28L already defined)
(label P29L already defined)
(label P50L already defined)
(label P51L already defined)
(label P61L already defined)
(label P63L already defined)
(label P20L already defined)
(label P36L already defined)
(label P37L already defined)
(label P40L already defined)
(label P21L already defined)
(label P53L already defined)
(label P54L already defined)
(label P55L already defined)
(label P56L already defined)
(label P57L already defined)
(label P58L already defined)
(label P59L already defined)
(label P65L already defined)
(label P24L already defined)
(label P60L already defined)
(label P25L already defined)
(label P26L already defined)
(label hrhtype already defined)
(label prunecat already defined)

. append using "./CPS Clean/cleaned_data_79to84.dta"
(label P30L already defined)
(label ch05 already defined)
(label ch613 already defined)
(label ch1417 already defined)
(label P47L already defined)
(label P24L already defined)
(label P60L already defined)
(label hrhtype already defined)
(label P36L already defined)
(label P40L already defined)
(label I25c already defined)
(label I25d already defined)
(label prunecat already defined)

. 
. // Make the state dummies consistent
. replace stfips = 1 if state == 63               // Alabama
(948 real changes made)

. replace stfips = 2 if state == 94               // Alaska
(502 real changes made)

. replace stfips = 4 if state == 86               // Arizona
(561 real changes made)

. replace stfips = 5 if state == 71               // Arkansas
(828 real changes made)

. replace stfips = 6 if state == 93               // California
(3,956 real changes made)

. replace stfips = 8 if state == 84               // Colorado
(776 real changes made)

. replace stfips = 9 if state == 16       // Connecticut
(750 real changes made)

. replace stfips = 10 if state == 51              // Delaware
(593 real changes made)

. replace stfips = 11 if state == 53              // DC
(334 real changes made)

. replace stfips = 12 if state == 59      // Florida
(1,705 real changes made)

. replace stfips = 13 if state == 58              // Georgia
(1,032 real changes made)

. replace stfips = 15 if state == 95              // Hawaii
(633 real changes made)

. replace stfips = 16 if state == 82              // Idaho
(640 real changes made)

. replace stfips = 17 if state == 32      // Indiana
(4,855 real changes made)

. replace stfips = 18 if state == 33              // Illinois
(9,520 real changes made)

. replace stfips = 19 if state == 42              // Iowa
(1,201 real changes made)

. replace stfips = 20 if state == 47              // Kansas
(844 real changes made)

. replace stfips = 21 if state == 61              // Kentucky
(1,009 real changes made)

. replace stfips = 22 if state == 72              // Louisiana
(647 real changes made)

. replace stfips = 23 if state == 11              // Maine
(1,000 real changes made)

. replace stfips = 24 if state == 52      // Maryland     
(965 real changes made)

. replace stfips = 25 if state == 14              // Massachusetts
(1,937 real changes made)

. replace stfips = 26 if state == 34              // Michigan
(2,901 real changes made)

. replace stfips = 27 if state == 41              // Minnesota
(1,276 real changes made)

. replace stfips = 28 if state == 64              // Mississippi
(925 real changes made)

. replace stfips = 29 if state == 43              // Missouri
(1,171 real changes made)

. replace stfips = 30 if state == 81              // Montana
(765 real changes made)

. replace stfips = 31 if state == 46      // Nebraska
(982 real changes made)

. replace stfips = 32 if state == 88              // Nevada
(542 real changes made)

. replace stfips = 33 if state == 12      // New Hampshire
(715 real changes made)

. replace stfips = 34 if state == 22              // New Jersey
(1,717 real changes made)

. replace stfips = 35 if state == 85              // New Mexico
(529 real changes made)

. replace stfips = 36 if state == 21              // New York
(2,732 real changes made)

. replace stfips = 37 if state == 56              // North Carolina
(1,884 real changes made)

. replace stfips = 38 if state == 44              // North Dakota
(811 real changes made)

. replace stfips = 39 if state == 31              // Ohio
(3,277 real changes made)

. replace stfips = 40 if state == 73      // Oklahoma 
(625 real changes made)

. replace stfips = 41 if state == 92              // Oregon
(721 real changes made)

. replace stfips = 42 if state == 23              // Pennsylvania
(3,229 real changes made)

. replace stfips = 44 if state == 15              // Rhode Island
(884 real changes made)

. replace stfips = 45 if state == 57              // South Carolina
(904 real changes made)

. replace stfips = 46 if state == 45      // South Dakota
(996 real changes made)

. replace stfips = 47 if state == 62              // Tennessee
(980 real changes made)

. replace stfips = 48 if state == 74              // Texas
(2,180 real changes made)

. replace stfips = 49 if state == 87              // Utah
(793 real changes made)

. replace stfips = 50 if state == 13              // Vermont
(799 real changes made)

. replace stfips = 51 if state == 54              // Virginia
(1,145 real changes made)

. replace stfips = 53 if state == 91              // Washington
(754 real changes made)

. replace stfips = 54 if state == 55              // West Virginia
(809 real changes made)

. replace stfips = 55 if state == 35              // Wisconsin
(1,555 real changes made)

. replace stfips = 56 if state == 83              // Wyoming
(442 real changes made)

. 
. // Replace the highest grade completed
. gen educ = gradeat
(239,740 missing values generated)

. replace educ = 0 if grade92 == 31  // Less Than 1st Grade
(387 real changes made)

. replace educ = 2.5 if grade92 == 32  // 1st to 4th Grade
(1,364 real changes made)

. replace educ = 5.5 if grade92 == 33  // 5th to 6th Grade
(3,217 real changes made)

. replace educ = 7.5 if grade92 == 34  // 7th to 8th Grade
(3,687 real changes made)

. replace educ = 9 if grade92 == 35  // 9th Grade
(3,732 real changes made)

. replace educ = 10 if grade92 == 36 // 10th Grade
(5,142 real changes made)

. replace educ = 11 if grade92 == 37 // 11th Grade
(7,884 real changes made)

. replace educ = 12 if grade92 == 38 // 12th Grade No Diploma
(2,641 real changes made)

. replace educ = 13 if grade92 == 39 // High School Graduate
(91,404 real changes made)

. replace educ = 14 if grade92 == 40 // Some College, No Degree
(51,737 real changes made)

. replace educ = 15 if grade92 == 41 // Associate Degree (Occupational/Vocational)
(16,459 real changes made)

. replace educ = 15 if grade92 == 42 // Associate Degree (Academic)
(15,819 real changes made)

. replace educ = 16 if grade92 == 43 // Bachelor's Degree
(29,698 real changes made)

. replace educ = 17 if grade92 == 44 // Master's Degree
(5,314 real changes made)

. replace educ = 18 if grade92 == 45 // Professional Degree
(703 real changes made)

. replace educ = 18 if grade92 == 46 // Doctorate Degree
(552 real changes made)

. 
. // Make consistent industry variable
. 
. /* New industry mapping
> 1 --> Agriculture/Forestry/Fishing/Hunting
> 2 --> Mining/Quarrying/OilExtraction
> 3 --> Construction
> 4 --> Manufacturing
> 5 --> Wholesale Trade
> 6 --> Retail Trade
> 7 --> Transportation and Warehousing
> 8 --> Utilities
> 9 --> Information/Communications
> 10 --> Finance/Insurance
> 11 --> Real Estate/Renting
> 12 --> Professional/Scientific/Technical Services
> 13 --> Management of Companies/Enterprises/Consulting
> 14 --> Administrative/Support/Waste Management Services
> 15 --> Education
> 16 --> Healthcare/Social Assistance
> 17 --> Arts/Entertainment/Recreation
> 18 --> Accomodation/Food Services
> 19 --> Other Services (e.g. car maintenance, beauty salons, religion, funeral homes)
> 20 --> Public Administration
> 21 --> Military
> */
. 
. cap drop ind

. gen ind = .
(327,025 missing values generated)

. 
. replace ind = 1 if (year >= 2020) & ind17 <= 290
(284 real changes made)

. replace ind = 2 if (year >= 2020) & ind17 >= 370 & ind17 <= 490
(150 real changes made)

. replace ind = 3 if (year >= 2020) & ind17 == 770
(1,785 real changes made)

. replace ind = 4 if (year >= 2020) & ind17 >= 1070 & ind17 <= 3990
(3,193 real changes made)

. replace ind = 5 if (year >= 2020) & ind17 >= 4070 & ind17 <= 4590
(279 real changes made)

. replace ind = 6 if (year >= 2020) & ind17 >= 4670 & ind17 <= 5790
(3,302 real changes made)

. replace ind = 7 if (year >= 2020) & ind17 >= 6070 & ind17 <= 6390
(1,109 real changes made)

. replace ind = 8 if (year >= 2020) & ind17 >= 570 & ind17 <= 690
(237 real changes made)

. replace ind = 9 if (year >= 2020) & ind17 >= 6470 & ind17 <= 6780
(207 real changes made)

. replace ind = 10 if (year >= 2020) & ind17 >= 6870 & ind17 <= 6992
(714 real changes made)

. replace ind = 11 if (year >= 2020) & ind17 >= 7071 & ind17 <= 7190
(190 real changes made)

. replace ind = 12 if (year >= 2020) & ind17 >= 7270 & ind17 <= 7490
(666 real changes made)

. replace ind = 13 if (year >= 2020) & ind17 == 7570
(1 real change made)

. replace ind = 14 if (year >= 2020) & ind17 >= 7580 & ind17 <= 7790
(895 real changes made)

. replace ind = 15 if (year >= 2020) & ind17 >= 7860 & ind17 <= 7890
(906 real changes made)

. replace ind = 16 if (year >= 2020) & ind17 >= 7970 & ind17 <= 8470
(5,153 real changes made)

. replace ind = 17 if (year >= 2020) & ind17 >= 8561 & ind17 <= 8590
(359 real changes made)

. replace ind = 18 if (year >= 2020) & ind17 >= 8660 & ind17 <= 8690
(1,997 real changes made)

. replace ind = 19 if (year >= 2020) & ind17 >= 8770 & ind17 <= 9290
(590 real changes made)

. replace ind = 20 if (year >= 2020) & ind17 >= 9370 & ind17 <= 9590
(1,249 real changes made)

. replace ind = 21 if (year >= 2020) & ind17 >= 9670 & ind17 <= 9870
(0 real changes made)

. 
.         
. replace ind = 1 if (year >= 2000 & year <= 2019) & ind02 <= 290
(1,489 real changes made)

. replace ind = 2 if (year >= 2000 & year <= 2019) & ind02 >= 370 & ind02 <= 490
(1,229 real changes made)

. replace ind = 3 if (year >= 2000 & year <= 2019) & ind02 == 770
(10,906 real changes made)

. replace ind = 4 if (year >= 2000 & year <= 2019) & ind02 >= 1070 & ind02 <= 3990
(25,024 real changes made)

. replace ind = 5 if (year >= 2000 & year <= 2019) & ind02 >= 4070 & ind02 <= 4590
(2,215 real changes made)

. replace ind = 6 if (year >= 2000 & year <= 2019) & ind02 >= 4690 & ind02 <= 5790
(22,441 real changes made)

. replace ind = 7 if (year >= 2000 & year <= 2019) & ind02 >= 6070 & ind02 <= 6390
(7,221 real changes made)

. replace ind = 8 if (year >= 2000 & year <= 2019) & ind02 >= 570 & ind02 <= 690
(1,715 real changes made)

. replace ind = 9 if (year >= 2000 & year <= 2019) & ind02 >= 6470 & ind02 <= 6780
(2,704 real changes made)

. replace ind = 10 if (year >= 2000 & year <= 2019) & ind02 >= 6870 & ind02 <= 6990
(5,020 real changes made)

. replace ind = 11 if (year >= 2000 & year <= 2019) & ind02 >= 7070 & ind02 <= 7190
(1,431 real changes made)

. replace ind = 12 if (year >= 2000 & year <= 2019) & ind02 >= 7270 & ind02 <= 7490
(3,841 real changes made)

. replace ind = 13 if (year >= 2000 & year <= 2019) & ind02 == 7570
(41 real changes made)

. replace ind = 14 if (year >= 2000 & year <= 2019) & ind02 >= 7580 & ind02 <= 7790
(5,025 real changes made)

. replace ind = 15 if (year >= 2000 & year <= 2019) & ind02 >= 7860 & ind02 <= 7890
(10,545 real changes made)

. replace ind = 16 if (year >= 2000 & year <= 2019) & ind02 >= 7970 & ind02 <= 8470
(33,984 real changes made)

. replace ind = 17 if (year >= 2000 & year <= 2019) & ind02 >= 8560 & ind02 <= 8590
(2,806 real changes made)

. replace ind = 18 if (year >= 2000 & year <= 2019) & ind02 >= 8660 & ind02 <= 8690 
(13,931 real changes made)

. replace ind = 19 if (year >= 2000 & year <= 2019) & ind02 >= 8770 & ind02 <= 9290
(3,950 real changes made)

. replace ind = 20 if (year >= 2000 & year <= 2019) & ind02 >= 9370 & ind02 <= 9590
(7,319 real changes made)

. replace ind = 21 if (year >= 2000 & year <= 2019) & ind02 >= 9670 & ind02 <= 9870
(0 real changes made)

.         
. // Uses 1990 codes?
. replace ind = 1 if (year >= 1983 & year <= 1999) & ind80 <= 32
(1,440 real changes made)

. replace ind = 2 if (year >= 1983 & year <= 1999) & ind80 >= 40 & ind80 <= 50
(1,105 real changes made)

. replace ind = 3 if (year >= 1983 & year <= 1999) & ind80 == 60
(6,704 real changes made)

. replace ind = 4 if (year >= 1983 & year <= 1999) & ind80 >= 100 & ind80 <= 392
(28,913 real changes made)

. replace ind = 5 if (year >= 1983 & year <= 1999) & ind80 >= 500 & ind80 <= 571
(2,591 real changes made)

. replace ind = 6 if (year >= 1983 & year <= 1999) & ind80 >= 580 & ind80 <= 691
(21,087 real changes made)

. replace ind = 7 if (year >= 1983 & year <= 1999) & ind80 >= 400 & ind80 <= 432
(5,957 real changes made)

. replace ind = 8 if (year >= 1983 & year <= 1999) & ind80 >= 450 & ind80 <= 472
(2,121 real changes made)

. replace ind = 9 if (year >= 1983 & year <= 1999) & ind80 >= 440 & ind80 <= 442
(1,688 real changes made)

. replace ind = 10 if (year >= 1983 & year <= 1999) & ind80 >= 700 & ind80 <= 711
(3,438 real changes made)

. replace ind = 11 if (year >= 1983 & year <= 1999) & ind80 == 712
(700 real changes made)

. replace ind = 12 if (year >= 1983 & year <= 1999) & ind80 >= 882 & ind80 <= 891 | ind80 == 893 | ind80 == 841
(1,347 real changes made)

. replace ind = 13 if (year >= 1983 & year <= 1999) & ind80 == 892
(45 real changes made)

. replace ind = 14 if (year >= 1983 & year <= 1999) & ind80 >= 721 & ind80 <= 760
(3,501 real changes made)

. replace ind = 15 if (year >= 1983 & year <= 1999) & ind80 >= 842 & ind80 <= 860
(6,899 real changes made)

. replace ind = 16 if (year >= 1983 & year <= 1999) & ((ind80 >= 812 & ind80 <= 840) | (ind80 >= 861 & ind80 <= 871))
(18,764 real changes made)

. replace ind = 17 if (year >= 1983 & year <= 1999) & ind80 >= 800 & ind80 <= 810 | ind80 == 872
(1,081 real changes made)

. replace ind = 18 if (year >= 1983 & year <= 1999) & ind80 >= 762 & ind80 <= 770
(1,715 real changes made)

. replace ind = 19 if (year >= 1983 & year <= 1999) & ind80 >= 771 & ind80 <= 791 | ind80 == 761 
(1,319 real changes made)

. replace ind = 20 if (year >= 1983 & year <= 1999) & ind80 >= 900 & ind80 <= 932
(5,060 real changes made)

. replace ind = 21 if (year >= 1983 & year <= 1999) & ind80 >= 940 & ind80 <= 960
(0 real changes made)

. 
. // Dataset lacks a military industry but it's okay because they aren't paid hourly anyways
. replace ind = 1 if (year <= 1982) & ind70 <= 28
(308 real changes made)

. replace ind = 2 if (year <= 1982) & ind70 >= 47 & ind70 <= 57
(305 real changes made)

. replace ind = 3 if (year <= 1982) & ind70 >= 67 & ind70 <= 77
(1,728 real changes made)

. replace ind = 4 if (year <= 1982) & ind70 >= 107 & ind70 <= 398
(8,167 real changes made)

. replace ind = 5 if (year <= 1982) & ind70 >= 507 & ind70 <= 588
(539 real changes made)

. replace ind = 6 if (year <= 1982) & ind70 >= 607 & ind70 <= 698
(4,022 real changes made)

. replace ind = 7 if (year <= 1982) & ind70 >= 407 & ind70 <= 429
(1,004 real changes made)

. replace ind = 8 if (year <= 1982) & ind70 >= 467 & ind70 <= 479
(482 real changes made)

. replace ind = 9 if (year <= 1982) & ind70 >= 447 & ind70 <= 449
(498 real changes made)

. replace ind = 10 if (year <= 1982) & ind70 >= 707 & ind70 <= 717
(501 real changes made)

. replace ind = 11 if (year <= 1982) & ind70 == 718
(109 real changes made)

. replace ind = 12 if (year <= 1982) & ind70 >= 888 & ind70 <= 897 | ind70 == 849
(174 real changes made)

. replace ind = 13 if (year <= 1982) & ind70 == 738
(22 real changes made)

. replace ind = 14 if (year <= 1982) & ind70 >= 727 & ind70 <= 759
(488 real changes made)

. replace ind = 15 if (year <= 1982) & ind70 >= 857 & ind70 <= 868
(1,235 real changes made)

. replace ind = 16 if (year <= 1982) & ((ind70 >= 828 & ind70 <= 848) | ind70 >= 878 | ind70 == 879)
(4,497 real changes made)

. replace ind = 17 if (year <= 1982) & (ind70 >= 807 & ind70 <= 809 | ind70 == 869)
(149 real changes made)

. replace ind = 18 if (year <= 1982) & (ind70 == 777 | ind70 == 778)
(276 real changes made)

. replace ind = 19 if (year <= 1982) & ((ind70 >= 779 & ind70 <= 798) | ind70 == 877 | ind70 == 887)
(311 real changes made)

. replace ind = 20 if (year <= 1982) & ind70 >= 907 & ind70 <= 937
(1,184 real changes made)

. // replace ind = 21 if ...
. 
. // Reintroduce the labels for the new ind variable
. label define ind_label 1 "Agriculture/Forestry/Fishing/Hunting" ///
>                        2 "Mining/Oil" ///
>                        3 "Construction" ///
>                        4 "Manufacturing" ///
>                        5 "Wholesale Trade" ///
>                        6 "Retail Trade" ///
>                        7 "Transportation/Warehousing" ///
>                        8 "Utilities" ///
>                        9 "Communications" ///
>                        10 "Finance/Insurance" ///
>                        11 "Real Estate" ///
>                        12 "Professional/Scientific/Technical Services" ///
>                        13 "Consulting" ///
>                        14 "Business Administrative/Support Services" ///
>                        15 "Education" ///
>                        16 "Healthcare/Social Assistance" ///
>                        17 "Arts/Entertainment/Recreation" ///
>                        18 "Accommodation/Food Services" ///
>                        19 "Other Services" ///
>                        20 "Public Administration" ///
>                        21 "Military"

. 
. label values ind ind_label

. 
. drop if missing(ind)            // Drops 298 observations, all from older datasets
(858 observations deleted)

. 
. 
. 
. // Make a consistent new occupation variable
. 
. cap drop occ

. gen occ = .
(326,167 missing values generated)

. 
. replace occ = 1 if (year >= 2020) & occ18 <= 440 
(621 real changes made)

. replace occ = 2 if (year >= 2020) & occ18 >= 500 & occ18 <= 960
(537 real changes made)

. replace occ = 3 if (year >= 2020) & occ18 >= 1005 & occ18 <= 1240
(243 real changes made)

. replace occ = 4 if (year >= 2020) & occ18 >= 1305 & occ18 <= 1560
(228 real changes made)

. replace occ = 5 if (year >= 2020) & occ18 >= 1600 & occ18 <= 1980
(116 real changes made)

. replace occ = 6 if (year >= 2020) & occ18 >= 2001 & occ18 <= 2060
(269 real changes made)

. replace occ = 7 if (year >= 2020) & occ18 >= 2100 & occ18 <= 2180
(95 real changes made)

. replace occ = 8 if (year >= 2020) & occ18 >= 2205 & occ18 <= 2255
(13 real changes made)

. replace occ = 9 if (year >= 2020) & occ18 >= 2600 & occ18 <= 2970
(170 real changes made)

. replace occ = 10 if (year >= 2020) & occ18 >= 3000 & occ18 <= 3550
(2,494 real changes made)

. replace occ = 11 if (year >= 2020) & occ18 >= 3601 & occ18 <= 4655
(5,482 real changes made)

. replace occ = 12 if (year >= 2020) & occ18 >= 3700 & occ18 <= 3960
(745 real changes made)

. replace occ = 13 if (year >= 2020) & occ18 >= 4000 & occ18 <= 4160
(1,909 real changes made)

. replace occ = 14 if (year >= 2020) & occ18 >= 4200 & occ18 <= 4255
(1,202 real changes made)

. replace occ = 15 if (year >= 2020) & occ18 >= 4300 & occ18 <= 4655
(308 real changes made)

. replace occ = 16 if (year >= 2020) & occ18 >= 4700 & occ18 <= 4965
(2,035 real changes made)

. replace occ = 17 if (year >= 2020) & occ18 >= 5000 & occ18 <= 5940
(3,522 real changes made)

. replace occ = 18 if (year >= 2020) & occ18 >= 6005 & occ18 <= 6130
(229 real changes made)

. replace occ = 19 if (year >= 2020) & occ18 >= 6200 & occ18 <= 6950
(1,654 real changes made)

. replace occ = 20 if (year >= 2020) & occ18 >= 7000 & occ18 <= 7640
(994 real changes made)

. replace occ = 21 if (year >= 2020) & occ18 >= 7700 & occ18 <= 8990
(2,528 real changes made)

. replace occ = 22 if (year >= 2020) & occ18 >= 9005 & occ18 <= 9430
(929 real changes made)

. replace occ = 23 if (year >= 2020) & occ18 >= 9510 & occ18 <= 9760
(1,107 real changes made)

. replace occ = 24 if (year >= 2020) & occ18 >= 9800
(0 real changes made)

. 
. // For some reason occ2012 and occ2011 are split; they are the same
. replace occ = 1 if (year >= 2012 & year <= 2019) & occ2012 <= 430
(1,247 real changes made)

. replace occ = 2 if (year >= 2012 & year <= 2019) & occ2012 >= 500 & occ2012 <= 950
(1,123 real changes made)

. replace occ = 3 if (year >= 2012 & year <= 2019) & occ2012 >= 1000 & occ2012 <= 1240
(454 real changes made)

. replace occ = 4 if (year >= 2012 & year <= 2019) & occ2012 >= 1300 & occ2012 <= 1560
(602 real changes made)

. replace occ = 5 if (year >= 2012 & year <= 2019) & occ2012 >= 1600 & occ2012 <= 1965
(232 real changes made)

. replace occ = 6 if (year >= 2012 & year <= 2019) & occ2012 >= 2000 & occ2012 <= 2060
(581 real changes made)

. replace occ = 7 if (year >= 2012 & year <= 2019) & occ2012 >= 2100 & occ2012 <= 2160
(247 real changes made)

. replace occ = 8 if (year >= 2012 & year <= 2019) & occ2012 >= 2200 & occ2012 <= 2550
(2,168 real changes made)

. replace occ = 9 if (year >= 2012 & year <= 2019) & occ2012 >= 2600 & occ2012 <= 2960
(478 real changes made)

. replace occ = 10 if (year >= 2012 & year <= 2019) & occ2012 >= 3000 & occ2012 <= 3540
(6,164 real changes made)

. replace occ = 11 if (year >= 2012 & year <= 2019) & occ2012 >= 3600 & occ2012 <= 3655
(2,666 real changes made)

. replace occ = 12 if (year >= 2012 & year <= 2019) & occ2012 >= 3700 & occ2012 <= 3955
(1,825 real changes made)

. replace occ = 13 if (year >= 2012 & year <= 2019) & occ2012 >= 4000 & occ2012 <= 4160
(5,757 real changes made)

. replace occ = 14 if (year >= 2012 & year <= 2019) & occ2012 >= 4200 & occ2012 <= 4250
(3,312 real changes made)

. replace occ = 15 if (year >= 2012 & year <= 2019) & occ2012 >= 4300 & occ2012 <= 4650
(1,762 real changes made)

. replace occ = 16 if (year >= 2012 & year <= 2019) & occ2012 >= 4700 & occ2012 <= 4965
(6,172 real changes made)

. replace occ = 17 if (year >= 2012 & year <= 2019) & occ2012 >= 5000 & occ2012 <= 5940
(10,320 real changes made)

. replace occ = 18 if (year >= 2012 & year <= 2019) & occ2012 >= 6005 & occ2012 <= 6130
(568 real changes made)

. replace occ = 19 if (year >= 2012 & year <= 2019) & occ2012 >= 6200 & occ2012 <= 6940
(4,065 real changes made)

. replace occ = 20 if (year >= 2012 & year <= 2019) & occ2012 >= 7000 & occ2012 <= 7630
(2,393 real changes made)

. replace occ = 21 if (year >= 2012 & year <= 2019) & occ2012 >= 7700 & occ2012 <= 8965
(7,083 real changes made)

. replace occ = 22 if (year >= 2012 & year <= 2019) & occ2012 >= 9000 & occ2012 <= 9420
(2,522 real changes made)

. replace occ = 23 if (year >= 2012 & year <= 2019) & occ2012 >= 9500 & occ2012 <= 9750
(1,611 real changes made)

. replace occ = 24 if (year >= 2012 & year <= 2019) & occ2012 >= 9800 & occ2012 <= 9830
(0 real changes made)

. 
. replace occ = 1 if (year >= 2011 & year <= 2012) & occ2011 <= 430
(237 real changes made)

. replace occ = 2 if (year >= 2011 & year <= 2012) & occ2011 >= 500 & occ2011 <= 950
(185 real changes made)

. replace occ = 3 if (year >= 2011 & year <= 2012) & occ2011 >= 1000 & occ2011 <= 1240
(83 real changes made)

. replace occ = 4 if (year >= 2011 & year <= 2012) & occ2011 >= 1300 & occ2011 <= 1560
(120 real changes made)

. replace occ = 5 if (year >= 2011 & year <= 2012) & occ2011 >= 1600 & occ2011 <= 1965
(59 real changes made)

. replace occ = 6 if (year >= 2011 & year <= 2012) & occ2011 >= 2000 & occ2011 <= 2060
(116 real changes made)

. replace occ = 7 if (year >= 2011 & year <= 2012) & occ2011 >= 2100 & occ2011 <= 2160
(54 real changes made)

. replace occ = 8 if (year >= 2011 & year <= 2012) & occ2011 >= 2200 & occ2011 <= 2550
(431 real changes made)

. replace occ = 9 if (year >= 2011 & year <= 2012) & occ2011 >= 2600 & occ2011 <= 2960
(104 real changes made)

. replace occ = 10 if (year >= 2011 & year <= 2012) & occ2011 >= 3000 & occ2011 <= 3540
(1,256 real changes made)

. replace occ = 11 if (year >= 2011 & year <= 2012) & occ2011 >= 3600 & occ2011 <= 3655
(567 real changes made)

. replace occ = 12 if (year >= 2011 & year <= 2012) & occ2011 >= 3700 & occ2011 <= 3955
(372 real changes made)

. replace occ = 13 if (year >= 2011 & year <= 2012) & occ2011 >= 4000 & occ2011 <= 4160
(1,142 real changes made)

. replace occ = 14 if (year >= 2011 & year <= 2012) & occ2011 >= 4200 & occ2011 <= 4250
(644 real changes made)

. replace occ = 15 if (year >= 2011 & year <= 2012) & occ2011 >= 4300 & occ2011 <= 4650
(359 real changes made)

. replace occ = 16 if (year >= 2011 & year <= 2012) & occ2011 >= 4700 & occ2011 <= 4965
(1,321 real changes made)

. replace occ = 17 if (year >= 2011 & year <= 2012) & occ2011 >= 5000 & occ2011 <= 5940
(2,361 real changes made)

. replace occ = 18 if (year >= 2011 & year <= 2012) & occ2011 >= 6005 & occ2011 <= 6130
(123 real changes made)

. replace occ = 19 if (year >= 2011 & year <= 2012) & occ2011 >= 6200 & occ2011 <= 6940
(761 real changes made)

. replace occ = 20 if (year >= 2011 & year <= 2012) & occ2011 >= 7000 & occ2011 <= 7630
(530 real changes made)

. replace occ = 21 if (year >= 2011 & year <= 2012) & occ2011 >= 7700 & occ2011 <= 8965
(1,438 real changes made)

. replace occ = 22 if (year >= 2011 & year <= 2012) & occ2011 >= 9000 & occ2011 <= 9420
(477 real changes made)

. replace occ = 23 if (year >= 2011 & year <= 2012) & occ2011 >= 9500 & occ2011 <= 9750
(315 real changes made)

. replace occ = 24 if (year >= 2011 & year <= 2012) & occ2011 >= 9800 & occ2011 <= 9830
(0 real changes made)

. 
. replace occ = 1 if (year >= 2000 & year <= 2010) & occ00 <= 430
(1,425 real changes made)

. replace occ = 2 if (year >= 2000 & year <= 2010) & occ00 >= 500 & occ00 <= 950
(1,251 real changes made)

. replace occ = 3 if (year >= 2000 & year <= 2010) & occ00 >= 1000 & occ00 <= 1240
(487 real changes made)

. replace occ = 4 if (year >= 2000 & year <= 2010) & occ00 >= 1300 & occ00 <= 1560
(862 real changes made)

. replace occ = 5 if (year >= 2000 & year <= 2010) & occ00 >= 1600 & occ00 <= 1960
(334 real changes made)

. replace occ = 6 if (year >= 2000 & year <= 2010) & occ00 >= 2000 & occ00 <= 2060
(675 real changes made)

. replace occ = 7 if (year >= 2000 & year <= 2010) & occ00 >= 2100 & occ00 <= 2150
(256 real changes made)

. replace occ = 8 if (year >= 2000 & year <= 2010) & occ00 >= 2200 & occ00 <= 2550
(2,587 real changes made)

. replace occ = 9 if (year >= 2000 & year <= 2010) & occ00 >= 2600 & occ00 <= 2960
(697 real changes made)

. replace occ = 10 if (year >= 2000 & year <= 2010) & occ00 >= 3000 & occ00 <= 3540
(7,754 real changes made)

. replace occ = 11 if (year >= 2000 & year <= 2010) & occ00 >= 3600 & occ00 <= 3650
(3,456 real changes made)

. replace occ = 12 if (year >= 2000 & year <= 2010) & occ00 >= 3700 & occ00 <= 3950
(2,312 real changes made)

. replace occ = 13 if (year >= 2000 & year <= 2010) & occ00 >= 4000 & occ00 <= 4160
(6,832 real changes made)

. replace occ = 14 if (year >= 2000 & year <= 2010) & occ00 >= 4200 & occ00 <= 4250
(4,010 real changes made)

. replace occ = 15 if (year >= 2000 & year <= 2010) & occ00 >= 4300 & occ00 <= 4650
(1,904 real changes made)

. replace occ = 16 if (year >= 2000 & year <= 2010) & occ00 >= 4700 & occ00 <= 4960
(8,124 real changes made)

. replace occ = 17 if (year >= 2000 & year <= 2010) & occ00 >= 5000 & occ00 <= 5930
(16,826 real changes made)

. replace occ = 18 if (year >= 2000 & year <= 2010) & occ00 >= 6000 & occ00 <= 6130
(618 real changes made)

. replace occ = 19 if (year >= 2000 & year <= 2010) & occ00 >= 6200 & occ00 <= 6940
(5,719 real changes made)

. replace occ = 20 if (year >= 2000 & year <= 2010) & occ00 >= 7000 & occ00 <= 7620
(3,682 real changes made)

. replace occ = 21 if (year >= 2000 & year <= 2010) & occ00 >= 7700 & occ00 <= 8960
(11,204 real changes made)

. replace occ = 22 if (year >= 2000 & year <= 2010) & occ00 >= 9000 & occ00 <= 9420
(3,310 real changes made)

. replace occ = 23 if (year >= 2000 & year <= 2010) & occ00 >= 9500 & occ00 <= 9750
(2,105 real changes made)

. replace occ = 24 if (year >= 2000 & year <= 2010) & occ00 >= 9800
(0 real changes made)

. 
. replace occ = 1 if (year >= 1983 & year <= 1999) & occ80 <= 19
(1,631 real changes made)

. replace occ = 2 if (year >= 1983 & year <= 1999) & occ80 >= 23 & occ80 <= 37
(1,403 real changes made)

. replace occ = 3 if (year >= 1983 & year <= 1999) & ((occ80 >= 64 & occ80 <= 68) | occ80 >= 229 | occ80 == 235)
(99,733 real changes made)

. replace occ = 4 if (year >= 1983 & year <= 1999) & (occ80 >= 43 & occ80 <= 59) | (occ80 >= 213 & occ80 <= 218)
(1,488 real changes made)

. replace occ = 5 if (year >= 1983 & year <= 1999) & (occ80 >= 69 & occ80 <= 83) | (occ80 >= 166 & occ80 <= 173) | (occ80 >= 
> 223 & occ80 <= 225)
(410 real changes made)

. replace occ = 6 if (year >= 1983 & year <= 1999) & occ80 >= 174 & occ80 <= 177
(380 real changes made)

. replace occ = 7 if (year >= 1983 & year <= 1999) & (occ80 >= 178 & occ80 <= 179 | occ80 == 234)
(143 real changes made)

. replace occ = 8 if (year >= 1983 & year <= 1999) & occ80 >= 113 & occ80 <= 165
(1,409 real changes made)

. replace occ = 9 if (year >= 1983 & year <= 1999) & (occ80 >= 183 & occ80 <= 199 | occ80 == 228)
(712 real changes made)

. replace occ = 10 if (year >= 1983 & year <= 1999) & (occ80 >= 84 & occ80 <= 89) | (occ80 >= 96 & occ80 <= 105) | (occ80 >= 
> 203 & occ80 <= 208) 
(3,597 real changes made)

. replace occ = 11 if (year >= 1983 & year <= 1999) & ((occ80 >= 445 & occ80 <= 447) | occ80 == 95 | occ80 == 106)
(8,026 real changes made)

. replace occ = 12 if (year >= 1983 & year <= 1999) & occ80 >= 413 & occ80 <= 427
(2,339 real changes made)

. replace occ = 13 if (year >= 1983 & year <= 1999) & occ80 >= 433 & occ80 <= 444
(7,756 real changes made)

. replace occ = 14 if (year >= 1983 & year <= 1999) & occ80 >= 448 & occ80 <= 455
(4,350 real changes made)

. replace occ = 15 if (year >= 1983 & year <= 1999) & (occ80 >= 456 & occ80 <= 469) | (occ80 >= 403 & occ80 <= 407)
(1,593 real changes made)

. replace occ = 16 if (year >= 1983 & year <= 1999) & occ80 >= 243 & occ80 <= 285
(10,059 real changes made)

. replace occ = 17 if (year >= 1983 & year <= 1999) & occ80 >= 303 & occ80 <= 389
(23,432 real changes made)

. replace occ = 18 if (year >= 1983 & year <= 1999) & occ80 >= 473 & occ80 <= 499
(1,577 real changes made)

. replace occ = 19 if (year >= 1983 & year <= 1999) & (occ80 >= 553 & occ80 <= 699) & (occ80 >= 865 & occ80 <= 869)
(0 real changes made)

. replace occ = 20 if (year >= 1983 & year <= 1999) & (occ80 >= 503 & occ80 <= 549 | occ80 == 864)
(6,290 real changes made)

. replace occ = 21 if (year >= 1983 & year <= 1999) & (occ80 >= 703 & occ80 <= 799 | occ80 == 233 | occ80 == 869)
(16,206 real changes made)

. replace occ = 22 if (year >= 1983 & year <= 1999) & ((occ80 >= 803 & occ80 <= 834) | (occ80 >= 226 & occ80 <= 227))
(4,357 real changes made)

. replace occ = 23 if (year >= 1983 & year <= 1999) & ((occ80 >= 843 & occ80 <= 859) & (occ80 >= 875 & occ80 <= 889) | occ80 
> == 863)
(1 real change made)

. replace occ = 24 if (year >= 1983 & year <= 1999) & occ80 == 905
(0 real changes made)

. 
. replace occ = 1 if (year <= 1982) & occ70 >= 201 & occ70 <= 245
(484 real changes made)

. replace occ = 2 if (year <= 1982) & (occ70 >= 55 & occ70 <= 56 | occ70 == 195 | occ70 == 26 | occ70 == 1)
(90 real changes made)

. replace occ = 3 if (year <= 1982) & occ70 >= 3 & occ70 <= 5 | occ70 >= 34 & occ70 <= 36
(31 real changes made)

. replace occ = 4 if (year <= 1982) & ((occ70 >= 6 & occ70 <= 23) | (occ70 >= 150 & occ70 <= 162) | occ70 == 2)
(331 real changes made)

. replace occ = 5 if (year <= 1982) & occ70 >= 42 & occ70 <= 54 | occ70 >= 91 & occ70 <= 96
(19 real changes made)

. replace occ = 6 if (year <= 1982) & (occ70 >= 86 & occ70 <= 90 | occ70 == 100 | occ70 == 174 | occ70 == 763) 
(38 real changes made)

. replace occ = 7 if (year <= 1982) & occ70 >= 30 & occ70 <= 31
(2 real changes made)

. replace occ = 8 if (year <= 1982) & occ70 >= 32 & occ70 <= 33 | occ70 >= 102 & occ70 <= 145
(149 real changes made)

. replace occ = 9 if (year <= 1982) & (occ70 >= 175 & occ70 <= 195 | occ70 == 101 | occ70 == 171)
(118 real changes made)

. replace occ = 10 if (year <= 1982) & (occ70 >= 61 & occ70 <= 73 | occ70 >= 80 & occ70 <= 83 | occ70 == 85) 
(234 real changes made)

. replace occ = 11 if (year <= 1982) & ((occ70 >= 74 & occ70 <= 76) | (occ70 >= 921 & occ70 <= 926) | occ70 == 84)
(1,677 real changes made)

. replace occ = 12 if (year <= 1982) & occ70 >= 960 & occ70 <= 965
(352 real changes made)

. replace occ = 13 if (year <= 1982) & occ70 >= 910 & occ70 <= 916
(1,470 real changes made)

. replace occ = 14 if (year <= 1982) & occ70 >= 901 & occ70 <= 903
(945 real changes made)

. replace occ = 15 if (year <= 1982) & (occ70 >= 931 & occ70 <= 954 | occ70 >= 980 & occ70 <= 984 | occ70 == 165 | occ70 == 7
> 40 | occ70 == 755)
(311 real changes made)

. replace occ = 16 if (year <= 1982) & occ70 >= 260 & occ70 <= 300
(1,021 real changes made)

. replace occ = 17 if (year <= 1982) & occ70 >= 301 & occ70 <= 395
(4,972 real changes made)

. replace occ = 18 if (year <= 1982) & (occ70 >= 801 & occ70 <= 824 | occ70 >= 24 & occ70 <= 25 | occ70 == 752 | occ70 == 761
> )
(214 real changes made)

. replace occ = 19 if (year <= 1982) & (occ70 >= 401 & occ70 <= 462 | occ70 == 750 | occ70 == 751) 
(2,507 real changes made)

. replace occ = 20 if (year <= 1982) & occ70 >= 470 & occ70 <= 575
(2,409 real changes made)

. replace occ = 21 if (year <= 1982) & occ70 >= 601 & occ70 <= 695 | occ70 >= 172 & occ70 <= 173
(5,358 real changes made)

. replace occ = 22 if (year <= 1982) & (occ70 >= 701 & occ70 <= 705 | occ70 >= 714 & occ70 <= 715 | occ70 >= 163 & occ70 <= 1
> 64 | occ70 == 170 | occ70 == 764)
(952 real changes made)

. replace occ = 23 if (year <= 1982) & (occ70 >= 706 & occ70 <= 713 | occ70 == 770 | occ70 == 762 | (occ70 >= 753 & occ70 <= 
> 754) | (occ70 >= 764 & occ70 <= 785))
(949 real changes made)

. replace occ = 24 if (year <= 1982) & occ70 == 580
(0 real changes made)

. 
. label define occ_label 1 "Management" ///
>                        2 "Financial Operations" ///
>                        3 "Computer/Math Operations" ///
>                        4 "Architecture/Engineering" ///
>                        5 "Life/Physical/Social Sciences" ///
>                        6 "Community/Social Services" ///
>                        7 "Legal" ///
>                        8 "Education" ///
>                        9 "Arts/Entertainment/Media" ///
>                        10 "Healthcare Practitioner" ///
>                        11 "Healthcare Support" ///
>                        12 "Protective Services" ///
>                        13 "Food Services" ///
>                        14 "Cleaning" ///
>                        15 "Personal Services" ///
>                        16 "Sales" ///
>                        17 "Administrative Support" ///
>                        18 "Farming/Fishing/Forestry" ///
>                        19 "Construction" ///
>                        20 "Installation/Maintenance" ///
>                        21 "Production" ///
>                                            22 "Transportation" ///
>                                            23 "Material Moving" ///
>                                            24 "Military" ///
> 

. label values occ occ_label

. 
. drop if missing(occ)
(439 observations deleted)

. 
. // Drop allocateds
. drop if I25a == 1 | I25b == 1 | I25c == 1 | I25d == 1     // 45,120 observations deleted mostly from recent years
(27,685 observations deleted)

. 
. 
. // Encode a numeric ID variable
. drop id 

. gen id = _n

. 
. save "cleaned_data.dta", replace
file cleaned_data.dta saved

. 
end of do-file

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. 
. // Perform the analysis
. do "analysis.do"

. clear all

. set memory 600m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set more off

. 
. local dir "/Users/kevincao/Desktop/ECON80/ECON80-Paper/"

. cd "`dir'"
/Users/kevincao/Desktop/ECON80/ECON80-Paper

. 
. local logfile analysis.log

. cap log close
