----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/analysis.log
  log type:  text
 opened on:  28 Oct 2024, 00:10:18

. 
. use "cleaned_data.dta", clear

. 
. // Add the annual CPI inflation data
. gen inflation = .
(80,277 missing values generated)

. replace inflation = 2.1 if year == 2017
(13,644 real changes made)

. replace inflation = 1.9 if year == 2018
(12,968 real changes made)

. replace inflation = 2.3 if year == 2019
(13,144 real changes made)

. replace inflation = 1.4 if year == 2020
(11,158 real changes made)

. replace inflation = 7.0 if year == 2021
(9,840 real changes made)

. replace inflation = 6.5 if year == 2022
(9,439 real changes made)

. replace inflation = 3.4 if year == 2023 
(10,084 real changes made)

. 
. 
. // Get real wage change (histogram + summary statistics by year)
. gen log_real_wage_change = log(earnhre / lag_earnhre) - (inflation / 100)

. 
. gen neg_inflation = -inflation

. levelsof year, local(years)
2017 2018 2019 2020 2021 2022 2023

. foreach y of local years {
  2.         
.         su neg_inflation if year == `y'
  3.         local neg_inflation_value = r(mean)
  4.         
.         histogram log_real_wage_change if year == `y', width(0.025) percent ///
>                 title("Distribution of Log Real Wage Change - Year `y'") ///
>                 xtitle("Log Real Wage Change") ytitle("Percentage") ///
>                 xline(`neg_inflation_value', lpattern(dash)) // ask prof staiger cuz this isn't working 
  5.                 
.         
.         graph export "/Users/kevincao/Desktop/ECON80/ECON80-Paper/Plots/histogram`y'.png", replace
  6.         
. }

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
neg_inflat~n |     13,644        -2.1           0       -2.1       -2.1
(bin=20, start=-.27046084, width=.025)
file /Users/kevincao/Desktop/ECON80/ECON80-Paper/Plots/histogram2017.png saved as PNG format

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
neg_inflat~n |     12,968        -1.9           0       -1.9       -1.9
(bin=20, start=-.26869696, width=.025)
file /Users/kevincao/Desktop/ECON80/ECON80-Paper/Plots/histogram2018.png saved as PNG format

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
neg_inflat~n |     13,144        -2.3           0       -2.3       -2.3
(bin=20, start=-.27298015, width=.025)
file /Users/kevincao/Desktop/ECON80/ECON80-Paper/Plots/histogram2019.png saved as PNG format

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
neg_inflat~n |     11,158        -1.4           0       -1.4       -1.4
(bin=20, start=-.26346084, width=.025)
file /Users/kevincao/Desktop/ECON80/ECON80-Paper/Plots/histogram2020.png saved as PNG format

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
neg_inflat~n |      9,840          -7           0         -7         -7
(bin=20, start=-.31946087, width=.025)
file /Users/kevincao/Desktop/ECON80/ECON80-Paper/Plots/histogram2021.png saved as PNG format

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
neg_inflat~n |      9,439        -6.5           0       -6.5       -6.5
(bin=20, start=-.31494173, width=.025)
file /Users/kevincao/Desktop/ECON80/ECON80-Paper/Plots/histogram2022.png saved as PNG format

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
neg_inflat~n |     10,084        -3.4           0       -3.4       -3.4
(bin=20, start=-.2838937, width=.025)
file /Users/kevincao/Desktop/ECON80/ECON80-Paper/Plots/histogram2023.png saved as PNG format

. 
. /*
> histogram log_real_wage_change if year != 2017, by(year) width(0.05) percent
> */
.         
. 
. /*
> levelsof year, local(years)
> foreach y of local years {
>         kdensity log_real_wage_change if year == `y', title("Year `y'")
>         pause "press enter"
> }
> */
. 
. // Could we first perhaps evaluate whether DNWR holds in the Card paper due to globalization and shift to serv
> ices?
. 
. // Generate important controls
. gen male = (sex == 1)

. gen white = (race == 1 & missing(ethnic))

. gen union = (unionmme == 1 | unioncov == 1)

. gen private_sector = (class94 >= 4)

. gen fulltime = (uhours >= 35)

. gen supporting_child = (ownchild > 0)

. gen immigrant = (prcitshp <= 3)

. 
. 
. 
. gen tradable = inlist(ind, 170, 180, 190, 270, 280, 290, ///
>                              370, 380, 390, 470, 480, 490, ///
>                              1070, 1080, 1090, 1170, 1180, 1190, ///
>                              1270, 1280, 1290, 1370, 1390, ///
>                              1470, 1480, 1490, 1570, 1590, 1670, ///
>                              1680, 1690, 1770, 1790, 1870, 1880, ///
>                              1890, 1990, 2070, 2090, 2170, 2180, ///
>                              2190, 2270, 2280, 2290, 2370, 2380, ///
>                              2390, 2470, 2480, 2490, 2570, 2590, ///
>                              2670, 2680, 2690, 2770, 2780, 2790, ///
>                              2870, 2880, 2890, 2970, 2980, 2990, ///
>                              3070, 3080, 3090, 3170, 3180, 3190, ///
>                              3290, 3360, 3370, 3380, 3390, ///
>                              3470, 3490, 3570, 3580, 3590, ///
>                              3670, 3680, 3690, 3770, 3780, 3790, ///
>                              3870, 3890, 3960, 3970, 3980, 3990, ///
>                              4070, 4080, 4090, 4170, 4180, 4190, ///
>                              4260, 4270, 4280, 4290, ///
>                              4370, 4380, 4390, 4470, 4480, 4490, ///
>                              4560, 4570, 4580, 4585, 4590, ///
>                              6070, 6080, 6090)

.                                                          
.                 
. 
. // Revisit this definition...
. gen gvc_integrated = inlist(ind, 3360, 3370, 3380, 3390, ///
>                                    3570, 3580, 3590, ///
>                                    3670, 3680, 3690, ///
>                                    1470, 1480, 1490, ///
>                                    1670, 1680, 1690, ///
>                                    2180, 2190, 2370, 2380, ///
>                                    2670, 2680, 2690, 2770, ///
>                                    2870, 2880, 2890, 2970,  ///
>                                    3090, 3170, 3180, 3190, ///
>                                    2070, 2090, 2290)

. 
. 
. 
. // Missing an education variable
. 
. // Study could... focus on peculiar economic times e.g. covid, gfc, great inflation, etc...
. 
. // Don't forget high income and low income differentiation
. // Also minimum wage and paid leave laws
. 
. 
. 
. local controls male white age union private_sector fulltime supporting_child immigrant tradable gvc_integrated

. 
. 
. // Assign a RTW dummy
. local rtw_states "1 2 4 6 10 12 13 15 17 18 24 27 29 33 34 36 40 41 42 44 45 47 48 49"

. gen rtw = 0

. foreach state in `rtw_states' {
  2.         
.         replace rtw = 1 if stfips == `state'
  3.         
. }
(1,200 real changes made)
(967 real changes made)
(1,409 real changes made)
(6,924 real changes made)
(854 real changes made)
(2,181 real changes made)
(1,229 real changes made)
(971 real changes made)
(2,363 real changes made)
(1,430 real changes made)
(808 real changes made)
(1,657 real changes made)
(1,480 real changes made)
(1,554 real changes made)
(1,034 real changes made)
(2,196 real changes made)
(979 real changes made)
(1,574 real changes made)
(2,782 real changes made)
(822 real changes made)
(870 real changes made)
(1,425 real changes made)
(4,098 real changes made)
(1,615 real changes made)

. 
. 
. 
. // Define wages being rigid
. gen rigid = (abs(log_wage_change) <= 0.01)

. 
. 
. // Establish the baseline regression first 
. logit rigid inflation union `controls' i.stfips i.year, robust                  // remove inflation? (why no c
> ollinear)

note: union omitted because of collinearity.
note: 2023.year omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -39902.637  
Iteration 1:   log pseudolikelihood = -39374.611  
Iteration 2:   log pseudolikelihood = -39369.585  
Iteration 3:   log pseudolikelihood = -39369.585  

Logistic regression                                    Number of obs =  80,277
                                                       Wald chi2(66) = 1055.01
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -39369.585                      Pseudo R2     =  0.0134

----------------------------------------------------------------------------------
                 |               Robust
           rigid | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
       inflation |  -.2011798   .0258492    -7.78   0.000    -.2518432   -.1505164
           union |  -.1322396   .0292284    -4.52   0.000    -.1895261    -.074953
            male |   .0551185   .0186259     2.96   0.003     .0186124    .0916246
           white |   .1265649   .0242469     5.22   0.000     .0790419     .174088
             age |   .0107208   .0006214    17.25   0.000     .0095029    .0119387
           union |          0  (omitted)
  private_sector |   .1486976   .0286474     5.19   0.000     .0925498    .2048454
        fulltime |  -.3584935   .0202535   -17.70   0.000    -.3981897   -.3187973
supporting_child |   .0203345   .0202865     1.00   0.316    -.0194264    .0600953
       immigrant |  -.1140955   .0302795    -3.77   0.000    -.1734423   -.0547487
        tradable |  -.1053156   .0304562    -3.46   0.001    -.1650087   -.0456225
  gvc_integrated |  -.1010198   .0485525    -2.08   0.037    -.1961811   -.0058586
                 |
          stfips |
             AK  |   .1835953     .10588     1.73   0.083    -.0239257    .3911163
             AZ  |  -.1357147   .1007762    -1.35   0.178    -.3332326    .0618031
             AR  |  -.0839573   .1105139    -0.76   0.447    -.3005606    .1326459
             CA  |   -.138827    .080162    -1.73   0.083    -.2959416    .0182877
             CO  |  -.1351102   .1178624    -1.15   0.252    -.3661162    .0958958
             CT  |   .1097924   .1113448     0.99   0.324    -.1084394    .3280242
             DE  |  -.0414293   .1121677    -0.37   0.712    -.2612741    .1784154
             DC  |   .2759758   .1349222     2.05   0.041     .0115332    .5404184
             FL  |   .0004942   .0902814     0.01   0.996     -.176454    .1774424
             GA  |  -.0023062   .1024944    -0.02   0.982    -.2031915     .198579
             HI  |  -.0126747    .110427    -0.11   0.909    -.2291076    .2037582
             ID  |  -.1223519   .0951344    -1.29   0.198    -.3088119     .064108
             IL  |   .0459724   .0888561     0.52   0.605    -.1281823    .2201271
             IN  |  -.2537584   .1018701    -2.49   0.013    -.4534201   -.0540967
             IA  |  -.1461499   .1028313    -1.42   0.155    -.3476955    .0553956
             KS  |  -.1025239   .1022402    -1.00   0.316     -.302911    .0978633
             KY  |   .1087868   .1047708     1.04   0.299    -.0965603    .3141339
             LA  |   .1696247   .1007187     1.68   0.092    -.0277803    .3670297
             ME  |  -.3116074   .1140505    -2.73   0.006    -.5351423   -.0880726
             MD  |  -.1291507   .1164395    -1.11   0.267    -.3573679    .0990664
             MA  |  -.1105075   .1011939    -1.09   0.275    -.3088439     .087829
             MI  |  -.1018017   .0915661    -1.11   0.266    -.2812679    .0776645
             MN  |  -.1886216   .0976334    -1.93   0.053    -.3799796    .0027363
             MS  |  -.0418789   .1012232    -0.41   0.679    -.2402728     .156515
             MO  |  -.2213049   .1003801    -2.20   0.027    -.4180462   -.0245636
             MT  |   -.150177   .0925933    -1.62   0.105    -.3316565    .0313024
             NE  |  -.0677822   .0972951    -0.70   0.486     -.258477    .1229126
             NV  |  -.0966547   .1041358    -0.93   0.353    -.3007572    .1074478
             NH  |  -.0897981   .0972892    -0.92   0.356    -.2804815    .1008852
             NJ  |   .0457088   .1059781     0.43   0.666    -.1620045    .2534221
             NM  |   .0143169   .1024812     0.14   0.889    -.1865426    .2151765
             NY  |  -.1690362   .0921292    -1.83   0.067    -.3496061    .0115337
             NC  |   .0850187   .0968425     0.88   0.380    -.1047892    .2748265
             ND  |  -.1625539   .0972563    -1.67   0.095    -.3531728    .0280651
             OH  |  -.0127194   .0862024    -0.15   0.883    -.1816731    .1562342
             OK  |    .294251   .1035184     2.84   0.004     .0913588    .4971433
             OR  |  -.1516356   .0982191    -1.54   0.123    -.3441416    .0408703
             PA  |  -.0450041   .0870648    -0.52   0.605     -.215648    .1256398
             RI  |   .0773997   .1118041     0.69   0.489    -.1417324    .2965318
             SC  |   .1095749    .109822     1.00   0.318    -.1056724    .3248221
             SD  |  -.1477632   .0995211    -1.48   0.138    -.3428209    .0472946
             TN  |  -.0415549   .0986583    -0.42   0.674    -.2349216    .1518118
             TX  |   .1321232   .0823489     1.60   0.109    -.0292778    .2935241
             UT  |  -.0934296   .0969316    -0.96   0.335     -.283412    .0965528
             VT  |  -.0474709    .104768    -0.45   0.650    -.2528125    .1578706
             VA  |   .0489497   .1032584     0.47   0.635    -.1534331    .2513324
             WA  |  -.0292904   .0936979    -0.31   0.755    -.2129349    .1543542
             WV  |  -.0900476    .098322    -0.92   0.360    -.2827551      .10266
             WI  |   .0070316   .0914064     0.08   0.939    -.1721217    .1861849
             WY  |   .0094098    .099204     0.09   0.924    -.1850265     .203846
                 |
            year |
           2018  |  -.1008674   .0327272    -3.08   0.002    -.1650115   -.0367233
           2019  |  -.0917269   .0285681    -3.21   0.001    -.1477192   -.0357345
           2020  |  -.2138726   .0422938    -5.06   0.000    -.2967669   -.1309783
           2021  |   .8650658   .1176566     7.35   0.000      .634463    1.095669
           2022  |   .5765978   .1057147     5.45   0.000     .3694008    .7837948
           2023  |          0  (omitted)
                 |
           _cons |  -1.135888   .1131884   -10.04   0.000    -1.357733   -.9140426
----------------------------------------------------------------------------------

. 
. gen inflation_GVC = inflation * gvc_integrated

. logit rigid inflation_GVC inflation union `controls' i.stfips i.year, robust

note: union omitted because of collinearity.
note: 2023.year omitted because of collinearity.
Iteration 0:   log pseudolikelihood = -39902.637  
Iteration 1:   log pseudolikelihood = -39374.617  
Iteration 2:   log pseudolikelihood = -39369.574  
Iteration 3:   log pseudolikelihood = -39369.573  

Logistic regression                                    Number of obs =  80,277
                                                       Wald chi2(67) = 1054.96
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -39369.573                      Pseudo R2     =  0.0134

----------------------------------------------------------------------------------
                 |               Robust
           rigid | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
   inflation_GVC |  -.0031711    .020778    -0.15   0.879    -.0438953     .037553
       inflation |  -.2010001   .0258742    -7.77   0.000    -.2517127   -.1502875
           union |  -.1322565   .0292274    -4.53   0.000    -.1895411   -.0749718
            male |   .0551121   .0186258     2.96   0.003     .0186063     .091618
           white |   .1265607    .024247     5.22   0.000     .0790375    .1740839
             age |   .0107205   .0006214    17.25   0.000     .0095025    .0119384
           union |          0  (omitted)
  private_sector |   .1486984   .0286473     5.19   0.000     .0925507    .2048461
        fulltime |  -.3585126    .020254   -17.70   0.000    -.3982097   -.3188154
supporting_child |   .0203414   .0202864     1.00   0.316    -.0194193    .0601021
       immigrant |  -.1140888   .0302795    -3.77   0.000    -.1734355   -.0547421
        tradable |  -.1053038   .0304561    -3.46   0.001    -.1649967   -.0456109
  gvc_integrated |  -.0911559   .0807799    -1.13   0.259    -.2494817    .0671699
                 |
          stfips |
             AK  |    .183617   .1058809     1.73   0.083    -.0239057    .3911398
             AZ  |  -.1356613   .1007804    -1.35   0.178    -.3331873    .0618647
             AR  |  -.0839701   .1105146    -0.76   0.447    -.3005747    .1326346
             CA  |   -.138808   .0801636    -1.73   0.083    -.2959257    .0183098
             CO  |  -.1350954   .1178622    -1.15   0.252    -.3661012    .0959103
             CT  |   .1097107   .1113493     0.99   0.324      -.10853    .3279514
             DE  |  -.0413776     .11217    -0.37   0.712    -.2612268    .1784717
             DC  |   .2760289   .1349228     2.05   0.041     .0115851    .5404728
             FL  |   .0005265   .0902836     0.01   0.995    -.1764261    .1774791
             GA  |  -.0022706   .1024965    -0.02   0.982    -.2031599    .1986188
             HI  |  -.0126463   .1104277    -0.11   0.909    -.2290806     .203788
             ID  |  -.1223135   .0951374    -1.29   0.199    -.3087793    .0641523
             IL  |   .0460095    .088858     0.52   0.605     -.128149    .2201681
             IN  |  -.2537368   .1018716    -2.49   0.013    -.4534014   -.0540722
             IA  |  -.1461555    .102833    -1.42   0.155    -.3477045    .0553935
             KS  |  -.1025014   .1022416    -1.00   0.316    -.3028913    .0978885
             KY  |   .1088248   .1047734     1.04   0.299    -.0965273    .3141768
             LA  |   .1696153     .10072     1.68   0.092    -.0277924    .3670229
             ME  |  -.3115626   .1140518    -2.73   0.006       -.5351   -.0880252
             MD  |  -.1291306   .1164403    -1.11   0.267    -.3573494    .0990882
             MA  |  -.1104556   .1011959    -1.09   0.275     -.308796    .0878848
             MI  |  -.1017706   .0915681    -1.11   0.266    -.2812407    .0776995
             MN  |  -.1886009   .0976346    -1.93   0.053    -.3799613    .0027594
             MS  |  -.0417888   .1012294    -0.41   0.680    -.2401948    .1566171
             MO  |  -.2212831   .1003814    -2.20   0.027    -.4180271   -.0245392
             MT  |  -.1501122   .0925973    -1.62   0.105    -.3315995    .0313751
             NE  |  -.0677867   .0972964    -0.70   0.486    -.2584842    .1229108
             NV  |  -.0966307   .1041371    -0.93   0.353    -.3007356    .1074742
             NH  |  -.0897617   .0972915    -0.92   0.356    -.2804496    .1009262
             NJ  |   .0457422   .1059795     0.43   0.666    -.1619737    .2534582
             NM  |   .0143732   .1024836     0.14   0.888     -.186491    .2152374
             NY  |  -.1690018   .0921315    -1.83   0.067    -.3495763    .0115726
             NC  |   .0849761   .0968412     0.88   0.380     -.104829    .2747813
             ND  |  -.1625168   .0972578    -1.67   0.095    -.3531385     .028105
             OH  |   -.012711   .0862035    -0.15   0.883    -.1816667    .1562447
             OK  |   .2942886     .10352     2.84   0.004      .091393    .4971841
             OR  |  -.1516117   .0982203    -1.54   0.123      -.34412    .0408967
             PA  |  -.0450253   .0870643    -0.52   0.605    -.2156681    .1256176
             RI  |    .077521   .1118151     0.69   0.488    -.1416326    .2966747
             SC  |   .1096258   .1098254     1.00   0.318     -.105628    .3248795
             SD  |   -.147704   .0995242    -1.48   0.138    -.3427679    .0473598
             TN  |  -.0415567   .0986609    -0.42   0.674    -.2349284    .1518151
             TX  |   .1321689   .0823519     1.60   0.109    -.0292379    .2935757
             UT  |  -.0934068   .0969331    -0.96   0.335    -.2833922    .0965785
             VT  |  -.0474498   .1047693    -0.45   0.651    -.2527939    .1578943
             VA  |    .048987   .1032602     0.47   0.635    -.1533994    .2513733
             WA  |  -.0292137   .0937017    -0.31   0.755    -.2128657    .1544383
             WV  |  -.0899663    .098323    -0.92   0.360    -.2826758    .1027432
             WI  |   .0071215   .0914121     0.08   0.938    -.1720429    .1862858
             WY  |   .0094439   .0992059     0.10   0.924    -.1849961    .2038838
                 |
            year |
           2018  |  -.1008454   .0327269    -3.08   0.002    -.1649889   -.0367019
           2019  |  -.0917094   .0285679    -3.21   0.001    -.1477014   -.0357173
           2020  |  -.2138078   .0422936    -5.06   0.000    -.2967018   -.1309138
           2021  |   .8649651   .1176569     7.35   0.000     .6343619    1.095568
           2022  |   .5764714   .1057175     5.45   0.000     .3692689    .7836739
           2023  |          0  (omitted)
                 |
           _cons |  -1.136461   .1132602   -10.03   0.000    -1.358447   -.9144746
----------------------------------------------------------------------------------

. 
end of do-file

