----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/construct.log
  log type:  text
 opened on:  29 Oct 2024, 09:31:56

. 
. 
. *************************** Compile the data **********************************
. 
. 
. use "morg05.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 22 23 {
  2.         
.         append using morg`year' 
  3.         
. }
(variable hrsample was str1, now str4 to accommodate using data's values)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label native already defined)
(label P15L already defined)
(label P14L already defined)
(label vet already defined)
(label P47L already defined)
(label ch1417 already defined)
(label ch613 already defined)
(label ch05 already defined)
(label ch35 already defined)
(label ch02 already defined)
(label P30L already defined)
(label P12L already defined)
(label P11L already defined)
(label P10L already defined)
(label P9L already defined)
(label age already defined)
(label cbsafips already defined)
(label smsa04 already defined)
(label P6L already defined)
(label P5L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label uhourse already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ2011l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(variable dind02 was byte, now int to accommodate using data's values)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label P27L already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ182l already defined)
(label occ18l already defined)
(label ind17l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label ethnic8 already defined)
(label race26 already defined)
(label cbsafipsl already defined)
(label dwrsnl already defined)
(label chldpresl already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ182l already defined)
(label occ18l already defined)
(label ind17l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label ethnic8 already defined)
(label race26 already defined)
(label cbsafipsl already defined)
(label dwrsnl already defined)
(label chldpresl already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ182l already defined)
(label occ18l already defined)
(label ind17l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label ethnic8 already defined)
(label race26 already defined)
(label cbsafipsl already defined)
(label dwrsnl already defined)
(label chldpresl already defined)

. 
. // Find number of observations for each household 
. egen nobs = count(hhid), by(hhid hrhhid2 lineno)

. 
. // Drop if there aren't 2 different observations (might need to investigate if certain types of households dro
> pped out so no bias from attrition) *just use nobs == 1 for this*
. keep if nobs == 2
(1,514,612 observations deleted)

. drop nobs

. 
. /*
> tab nobs minsamp if nobs == 2
> 
> tab nobs minsamp
> 
> tab year minsamp if nobs == 2
> */
. 
. // Create a unique identifier
. egen id = group(hhid hrhhid2 lineno)

. 
. tsset id year

Panel variable: id (weakly balanced)
 Time variable: year, 2005 to 2023
         Delta: 1 unit

. 
. // Drop anyone who may have changed jobs
. /*
> by id (year): gen job_change = (class94 != class94[_n-1]) | (ind02 != ind02[_n-1]) | (ind17 != ind17[_n-1]) | 
> (dind02 != dind02[_n-1]) | (occ2012 != occ2012[_n-1]) | (occ18 != occ18[_n-1])
> 
> drop if job_change == 1
> drop job_change
> */
. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(953,491 observations deleted)

. 
. // Drop anyone whose paid by hour status is questionable or may have changed
. keep if I25b == 0
(220,449 observations deleted)

. 
. // Remove anyone who is reported to have made $9999 per hour or missing (also people making like nothing?)
. drop if earnhre == 9999
(257 observations deleted)

. drop if missing(earnhre)
(2,024,939 observations deleted)

. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(353,692 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(687,492 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(343,746 missing values generated)

. drop if missing(lag_earnhre)
(343,746 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(93,418 observations deleted)

. 
. // Merge industry variables
. gen ind = .
(250,328 missing values generated)

. replace ind = ind02 if !missing(ind02)
(209,807 real changes made)

. replace ind = ind17 if missing(ind) & !missing(ind17)
(40,521 real changes made)

. // be careful in case there is a reworking of how these things are coded
. 
. // Merge occupation variables (need to merge the occs but they are coded differently)
. /*
> gen occ = .
> replace occ = occ002 if !missing(occ002)
> replace occ = occ18 if missing(occ) & !missing(occ18)
> */
. 
. // Save and export
. save "cleaned_data.dta", replace
file cleaned_data.dta saved

. 
. 
. log close 
      name:  <unnamed>
       log:  /Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/construct.log
  log type:  text
 closed on:  29 Oct 2024, 09:32:19
----------------------------------------------------------------------------------------------------------------
