----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/construct.log
  log type:  text
 opened on:  27 Oct 2024, 21:53:39

. 
. 
. *************************** Compile the data **********************************
. 
. 
. use "morg16.dta", clear

. 
. // Concatenate all years of data into one dataset
. foreach year in 17 18 19 20 21 22 23 {
  2.         
.         append using morg`year' 
  3.         
. }
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label ind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ182l already defined)
(label occ18l already defined)
(label ind17l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label ethnic8 already defined)
(label race26 already defined)
(label cbsafipsl already defined)
(label dwrsnl already defined)
(label chldpresl already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ182l already defined)
(label occ18l already defined)
(label ind17l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label ethnic8 already defined)
(label race26 already defined)
(label cbsafipsl already defined)
(label dwrsnl already defined)
(label chldpresl already defined)
(label hrhtype already defined)
(label yesno already defined)
(label P26L already defined)
(label P25L already defined)
(label P24L already defined)
(label P160L already defined)
(label P3594L already defined)
(label P23L already defined)
(label P22L already defined)
(label P21L already defined)
(label docc00l already defined)
(label occ182l already defined)
(label occ18l already defined)
(label ind17l already defined)
(label dind02 already defined)
(label P20L already defined)
(label P19L already defined)
(label I25d already defined)
(label I25c already defined)
(label P29L already defined)
(label P28L already defined)
(label P18L already defined)
(label P17L already defined)
(label P34L already defined)
(label P16L already defined)
(label penatvty already defined)
(label stfips already defined)
(label P4L already defined)
(label P3L already defined)
(label P2L already defined)
(label ethnic8 already defined)
(label race26 already defined)
(label cbsafipsl already defined)
(label dwrsnl already defined)
(label chldpresl already defined)

. 
. // Find number of observations for each household 
. egen nobs = count(hhid), by(hhid hrhhid2 lineno)

. 
. // Drop if there aren't 2 different observations (might need to investigate if certain types of households dro
> pped out so no bias from attrition) *just use nobs == 1 for this*
. drop if nobs == 1
(732,383 observations deleted)

. drop nobs

. 
. /*
> tab nobs minsamp if nobs == 2
> 
> tab nobs minsamp
> 
> tab year minsamp if nobs == 2
> */
. 
. // Create a unique identifier
. egen id = group(hhid hrhhid2 lineno)

. 
. tsset id year

Panel variable: id (weakly balanced)
 Time variable: year, 2016 to 2023
         Delta: 1 unit

. 
. // Drop anyone who may have changed jobs
. /*
> by id (year): gen job_change = (class94 != class94[_n-1]) | (ind02 != ind02[_n-1]) | (ind17 != ind17[_n-1]) | 
> (dind02 != dind02[_n-1]) | (occ2012 != occ2012[_n-1]) | (occ18 != occ18[_n-1])
> 
> drop if job_change == 1
> drop job_change
> */
. 
. // Drop anyone who isn't paid by the hour
. drop if paidhre == 2
(340,584 observations deleted)

. 
. // Drop anyone whose paid by hour status is questionable or may have changed
. keep if I25b == 0
(83,487 observations deleted)

. 
. // Remove anyone who is reported to have made $9999 per hour or missing
. drop if earnhre == 9999
(138 observations deleted)

. drop if missing(earnhre)
(747,874 observations deleted)

. 
. // Remove anyone without two observations
. egen id_count = count(id), by(id)

. keep if id_count == 2
(122,989 observations deleted)

. drop id_count

. 
. // Convert salaries to dollar unit
. replace earnhre = round(earnhre / 100, 0.01)
variable earnhre was int now float
(223,962 real changes made)

. 
. // Get wage change
. gen lag_earnhre = L.earnhre
(111,981 missing values generated)

. drop if missing(lag_earnhre)
(111,981 observations deleted)

. gen log_wage_change = ln(earnhre) - ln(lag_earnhre)

. 
. // For now... just drop anyone with a large change in wages
. drop if abs(log_wage_change) > 0.25
(31,704 observations deleted)

. 
. // Merge industry variables
. gen ind = .
(80,277 missing values generated)

. replace ind = ind02 if !missing(ind02)
(39,756 real changes made)

. replace ind = ind17 if missing(ind) & !missing(ind17)
(40,521 real changes made)

. // be careful in case there is a reworking of how these things are coded
. 
. // Save and export
. save "cleaned_data.dta", replace
file cleaned_data.dta saved

. 
. 
. log close 
      name:  <unnamed>
       log:  /Users/kevincao/Desktop/ECON80/ECON80-Paper/Data/construct.log
  log type:  text
 closed on:  27 Oct 2024, 21:53:47
----------------------------------------------------------------------------------------------------------------
